[
    {
        "id": "1",
        "Name": "The Alea Hotel Seminyak",
        "Ratings": "4.2",
        "Price": "4,403,576.00",
        "Addres": "Jl. Cendrawasih No.78, Seminyak, Kec. Kuta Utara, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.67463167686094, 115.15341976860144",
        "Description": "Set on a narrow, winding street, this upmarket hotel with an industrial-chic facade is 3 km from Seminyak Beach and 5 km from 3D experiences at Dream Museum Zone Bali (DMZ). Streamlined rooms with neutral hues feature free Wi-Fi, flat-screen TVs and minibars, as well as tea and coffeemakers. Upgraded quarters overlook or offer direct access to a pool. There's a sleek cocktail bar with marble floors, as well as outdoor pools and a spa. Breakfast is extra.",
        "Lat": "-8.674.631.677",
        "Long": "1.151.534.198",
        "Images": "https://pix10.agoda.net/hotelImages/569/569051/569051_15021910020025447086.jpg?ca=3&ce=1&s=1024x768"
    },
    {
        "id": "2",
        "Name": "Atanaya Kuta Bali",
        "Ratings": "4.4",
        "Price": "275,705.00",
        "Addres": "Jl. Sunset Road No.88A, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.70357015159306, 115.18059606116576",
        "Description": "This modern, casual hotel is an 8-minute walk from the unique exhibits at 3D Dream Museum Zone Bali, as well as 3 km from both the shops and restaurants of Seminyak and the beach. The warm-toned rooms and suites feature carved wood artwork, and offer free Wi-Fi, flat-screen TVs, minibars, and tea and coffeemaking facilities. Upgraded suites add living areas and mountain views. Amenities include a relaxed Chinese/Indonesian restaurant, an open-air cafe, and a laid-back bar next to the rooftop infinity pool and sun loungers. There's free parking.",
        "Lat": "-8.703.570.152",
        "Long": "1.151.805.961",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/267601572.jpg?k=9123f91c539819271cef4a0ebe94f2826425af7d9d8fc107382153faffcddf8e&o=&hp=1"
    },
    {
        "id": "3",
        "Name": "Grand Livio Kuta Hotel",
        "Ratings": "4.4",
        "Price": "176,762.00",
        "Addres": "Jl. Dewi Sri No.17, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.707926067445976, 115.1789058788881",
        "Description": "A 6 km drive from Bali Ngurah Rai International Airport, this trendy hotel is 1 km from buzzy Jalan Legian and 2 km from Legian Beach. Funky, colorful rooms offer minibars, flat-screen TVs and free Wi-Fi, as well as desks, safes, and tea and coffeemaking facilities. Upgraded rooms add living areas. Room service is available 24/7. Complimentary amenities include parking, and an international breakfast buffet. There's also a striking restaurant, and a bar with a streetfront terrace, plus an outdoor pool, and clubs for children age 12 and under.",
        "Lat": "-8.707.926.067",
        "Long": "1.151.789.059",
        "Images": "https://pix10.agoda.net/hotelImages/161/1612647/1612647_16101216460047680684.jpg?ca=6&ce=1&s=1024x768"
    },
    {
        "id": "4",
        "Name": "Mega Boutique Hotel & Spa",
        "Ratings": "4.3",
        "Price": "305,266.00",
        "Addres": "SImpang Siur, Jl. Bypass Ngurah Rai No.259, Kuta, Denpasar Selatan, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.721310373139259, 115.18644739196829",
        "Description": "Among shops and eateries on a bustling commercial street, this modern hotel is 4 km from lively Kuta Beach and 6 km from Ngurah Rai International Airport. Warmly furnished rooms feature Wi-Fi, flat-screen TVs and minifridges, as well as en suite bathrooms with free-standing tubs and additional flat-screens; some add furnished balconies. Room service is available 24/7. Breakfast is offered. There's also a relaxed restaurant, a gym and a spa, plus a rooftop terrace with an outdoor pool and a bar. Parking is available.",
        "Lat": "-8.721.310.373",
        "Long": "1.151.864.474",
        "Images": "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/10/28/a9687edd-e394-43d9-a43d-ffd2e10bd5f1-1603889379011-d989a7fb278f05c3631e17177d2bf383.jpg"
    },
    {
        "id": "5",
        "Name": "The ONE Legian",
        "Ratings": "4.3",
        "Price": "283,500.00",
        "Addres": "Jl. Raya Legian No.117, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.714040123752303, 115.17360076101478",
        "Description": "In a tree-lined area near shops and restaurants, this modern hotel is a 10-minute walk from Kuta Beach and 5 km from Ngurah Rai International Airport. Bright rooms feature flat-screens, free Wi-Fi and minifridges, plus tea and coffeemakers. Suites and family rooms add separate living areas. Some quarters have balconies and/or direct access to an outdoor pool. Room service is available. A free shuttle to Kuta Beach is available. A sleek rooftop terrace offers a pool, a bar and an eatery. There's also a casual restaurant with a street facing deck. Other amenities include a gym and a spa, as well as an additional outdoor pool on ground level.",
        "Lat": "-8.714.040.124",
        "Long": "1.151.736.008",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/08/80/a7/20/sky-pool--v8045648.jpg?w=900&h=-1&s=1"
    },
    {
        "id": "6",
        "Name": "Quest San Hotel Denpasar by ASTON",
        "Ratings": "4.4",
        "Price": "243,832.00",
        "Addres": "Jl. Mahendradatta No.93, Padangsambian, Kec. Denpasar Bar., Kota Denpasar, Bali 80117",
        "Coordinate": "-8.677243218009908, 115.19045399667871",
        "Description": "Set in a polished roadside building surrounded by palm trees, this modern hotel is 6 km from the Petitenget Temple, 7 km from Seminyak Beach, and 17 km from the silver and gold shops of Celuk Village. Warmly decorated rooms feature balconies, Wi-Fi and flat-screen TVs, as well as minibars, and tea and coffeemakers. Suites add DVD players and iPod docks, plus living areas and kitchenettes. Room service is available 24/7. Breakfast and parking are complimentary. There's also an airy restaurant, along with a gym and an outdoor pool.",
        "Lat": "-8.677.243.218",
        "Long": "115.190.454",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1280x900/45171835.jpg?k=104b3c7b1b7249bb3c409f7806406e786065fcec4f7e12ccb898b34fb4c34b2d&o=&hp=1"
    },
    {
        "id": "7",
        "Name": "Hadi Poetra Hotel",
        "Ratings": "4.2",
        "Price": "187,789.00",
        "Addres": "Jl. Raya Kuta No.323-378, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.72822868187097, 115.17682182773531",
        "Description": "In a brick building off a bustling road, this laid-back hotel is within walking distance of restaurants. It's also a 15-minute stroll from Segara Beach along Bali Sea, 1 km from the pools and slides at Waterbom Bali, and 4 km from Ngurah Rai International Airport. Relaxed rooms with partial wood-paneled walls feature flat-screens, free Wi-Fi and balconies. Upgraded rooms add terraces with direct pool access. Breakfast is served in a casual dining room. Other amenities include a bar, a rooftop terrace, and warm lounges that have rustic carved wood furnishings and antiques. There's also an outdoor pool. Airport shuttles are available.",
        "Lat": "-8.728.228.682",
        "Long": "1.151.768.218",
        "Images": "https://ik.imagekit.io/tvlk/apr-asset/dgXfoyh24ryQLRcGq00cIdKHRmotrWLNlvG-TxlcLxGkiDwaUSggleJNPRgIHCX6/hotel/asset/10004980-d656731a45f7d5556546d555485b11ab.jpeg?tr=q-40,c-at_max,w-1280,h-720&_src=imagekit"
    },
    {
        "id": "8",
        "Name": "POP! Hotel Teuku Umar",
        "Ratings": "4",
        "Price": "187,501.00",
        "Addres": "Jl. Teuku Umar No.74, Dauh Puri Kauh, Kec. Denpasar Bar., Kota Denpasar, Bali 80113",
        "Coordinate": "-8.679809043801406, 115.20384807278518",
        "Description": "Set in the town center, this colorful, contemporary hotel is 4 km from the Bali Museum, 6 km from Seminyak Beach and 12 km from Ngurah Rai International Airport. Offering free Wi-Fi, the bright, modern rooms also come with flat-screen TVs and air-conditioning. The hotel provides free parking, as well as a breakfast buffet, which is served in a vibrant dining room.",
        "Lat": "-8.679.809.044",
        "Long": "1.152.038.481",
        "Images": "https://pix10.agoda.net/hotelImages/230/230470/230470_15080710530033839490.jpg?ca=5&ce=1&s=1024x768"
    },
    {
        "id": "9",
        "Name": "Hotel Neo Denpasar by ASTON",
        "Ratings": "4.4",
        "Price": "235,203.00",
        "Addres": "Jl. Gatot Subroto Barat, Padangsambian Kaja, Kec. Denpasar Bar., Kota Denpasar, Bali 80117",
        "Coordinate": "-8.636521610430902, 115.19295921142802",
        "Description": "Set in a modern building, this stylish, contemporary hotel is 5 km from the Bali Museum, 9 km from the buzzing Seminyak area and 11 km from Legian Beach. The polished, minimalist rooms have flat-screen TVs, minibars and free Wi-Fi, as well as safes, and tea and coffeemakers. Upgraded rooms add complimentary breakfast and may have garden views, while suites include balconies and living rooms with sofas. There's a trendy, casual restaurant with a bar. Other amenities include an outdoor pool and a fitness center. Beauty treatments are available.",
        "Lat": "-863.652.161",
        "Long": "1.151.929.592",
        "Images": "https://denpasartourism.com/images/hotel-villa/5cb408c14f984.jpg"
    },
    {
        "id": "10",
        "Name": "BEST WESTERN Kuta Villa",
        "Ratings": "4.2",
        "Price": "291,456.00",
        "Addres": "Jl. Nyangnyang Sari, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.733302826584517, 115.17654141595072",
        "Description": "Set 3 km from Ngurah Rai International Airport, this polished hotel is also 6 km from Seminyak beach. The modern rooms offer free WiFi, flat-screen TVs, minifridges and 24-hour room service. Many have garden views; some feature terraces with outdoor showers. Suites add private plunge pools. Breakfast and parking are complimentary. There's an international restaurant, 2 bars and a cafe, as well as an outdoor pool, a 24-hour business center and BBQ grills.",
        "Lat": "-8.733.302.827",
        "Long": "1.151.765.414",
        "Images": "https://www.oyster.com/wp-content/uploads/sites/35/2019/05/pool-v8994583-1440-1024x683.jpg"
    },
    {
        "id": "11",
        "Name": "ASTON Denpasar Hotel & Convention Center",
        "Ratings": "4.3",
        "Price": "263,403.00",
        "Addres": "Jl. Gatot Subroto Barat No.283, Pemecutan Kaja, Kec. Denpasar Utara, Kota Denpasar, Bali 80111",
        "Coordinate": "-8.639328959951705, 115.20612697755939",
        "Description": "Featuring a stately entrance with a circular driveway, this upscale business hotel is 3.4 km from the Bali Museum and 12 km from vibrant Legian Beach. Low-key rooms with modern furnishings feature free Wi-Fi and flat-screen TVs, plus minifridges, safes, and tea and coffeemaking facilities. Suites add living rooms and soaking tubs. Room service is available. Freebies include breakfast and welcome drinks. There's a casual restaurant offering halal cuisine. Additional perks include a gym and a spa, plus 3 pools, 2 kids' pools, and a polished lobby with stone-carved murals. There's also a business center, a grand ballroom and a conference center.",
        "Lat": "-863.932.896",
        "Long": "115.206.127",
        "Images": "https://www.denpasarkota.go.id/uploads/datang/datang_193108090838_SetiapJumatSore,AstonDenpasarHotelConventionCenterHadirkanNongkrongBareng.jpg"
    },
    {
        "id": "12",
        "Name": "Instyle Kuta Hotel Bali​​",
        "Ratings": "4.4",
        "Price": "Nan",
        "Addres": "Jl. Dewi Sri I No.16, Legian, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.70192621229162, 115.17840364066421",
        "Description": "In an area with multiple eateries, this relaxed hotel with a modern vibe is 2 km from the lively Legian Beach and 8 km from Ngurah Rai International Airport. Bright, streamlined rooms have Wi-Fi, flat-screen TVs and balconies, plus tea and coffeemakers. Suites add sitting areas. Some quarters offer direct pool access. There's room service. Amenities include a sleek bistro, a coffee shop and an outdoor pool, as well as a rooftop terrace with bar service. Breakfast, parking and an airport shuttle are available.",
        "Lat": "-8.701.926.212",
        "Long": "1.151.784.036",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1280x900/175012715.jpg?k=93e51e0c435db4a00d3e3cfa1e6e5ecdfd570c64becf3dd212229b915e85c609&o=&hp=1"
    },
    {
        "id": "13",
        "Name": "Kyriad Royal Seminyak Bali",
        "Ratings": "4.5",
        "Price": "Nan",
        "Addres": "Jl. Sunset Road Jl. Nakula Gg. Baik-Baik No.1, Seminyak, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.692522362149882, 115.17333374434601",
        "Description": "Nan",
        "Lat": "-8.692.522.362",
        "Long": "1.151.733.337",
        "Images": "https://origin.pegipegi.com/jalan/images/pict1L/Y4/Y938224/Y938224001.jpg"
    },
    {
        "id": "14",
        "Name": "Duo Legian Hotel",
        "Ratings": "4.3",
        "Price": "329,254.00",
        "Addres": "Jl. Batu Pageh Gg. Melani, Legian, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.709335050716854, 115.17308241519616",
        "Description": "Set near shops and eateries, this casual hotel is a 3-minute walk from bustling Legian Street and 18 minutes on foot from Legian Beach. It's 8 km from Ngurah Rai International Airport. Simple rooms provide free Wi-Fi, satellite TV and air-conditioning. Amenities include complimentary parking, an informal restaurant and a terrace. There's 24-hour security. An airport shuttle is available by request for a surcharge.",
        "Lat": "-8.709.335.051",
        "Long": "1.151.730.824",
        "Images": "https://ak-d.tripcdn.com/images/200d0h0000008sz097D5F_R_550_412_R5_Q70_D.jpg"
    },
    {
        "id": "15",
        "Name": "Urban Style Biz Premier (Formerly Berry Biz Hotel)",
        "Ratings": "4.1",
        "Price": "208,651.00",
        "Addres": "Jl. Sunset Road No.99, Seminyak, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.697923957487985, 115.17770106794954",
        "Description": "A 4-minute walk from the interactive galleries at the 3D Dream Museum Zone Bali (DMZ), this laid-back hotel sits 5 km from both Kuta Beach and Waterbom Bali water park. Colorful rooms offer Wi-Fi, as well as flat-screen TVs, minibars, and tea and coffeemakers. They also include desks with dry erase boards. Some rooms are female only. Suites add separate living areas. Room service is available. Amenities include a lobby lounge, a trendy 24-hour coffee shop and a business center. Meeting rooms and breakfast are available.",
        "Lat": "-8.697.923.957",
        "Long": "1.151.777.011",
        "Images": "https://pix10.agoda.net/hotelImages/22216885/-1/13f7763d3ebe2b76c836c58f82488c45.jpg?ca=17&ce=1&s=1024x768"
    },
    {
        "id": "16",
        "Name": "Collection O 14 Sun Boutique Hotel",
        "Ratings": "3.2",
        "Price": "169,164.00",
        "Addres": "Jl. Sunset Road No.23, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.707547110350186, 115.18385294907577",
        "Description": "Nan",
        "Lat": "-870.754.711",
        "Long": "1.151.838.529",
        "Images": "https://ak-d.tripcdn.com/images/200n0o000000f540xE612_Z_550_412_R5_Q70_D.jpg"
    },
    {
        "id": "17",
        "Name": "The Kanjeng Suite & Villas - Seminyak",
        "Ratings": "3.6",
        "Price": "747,000.00",
        "Addres": "Jl. Dewi Saraswati III No.39, Seminyak, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.685775351447798, 115.17540371779114",
        "Description": "Nan",
        "Lat": "-8.685.775.351",
        "Long": "1.151.754.037",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1280x900/318905368.jpg?k=9e9ac5447f6747a704abdb781e7f0fbfcaf037abbabc9549af7500ab2054abc9&o=&hp=1"
    },
    {
        "id": "18",
        "Name": "Fame Hotel Sunset Road Kuta Bali",
        "Ratings": "4.4",
        "Price": "197,150.00",
        "Addres": "Jl. Sunset Road No.9, Legian, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.700705754284224, 115.17849903395621",
        "Description": "Set on a main road, this vibrant modern hotel is 3 km from Seminyak Beach and 7 km from Ngurah Rai International Airport. Featuring colorful artwork of celebrities, the down-to-earth rooms have free Wi-Fi and flat-screen TVs. Some add private balconies. Breakfast is complimentary. Amenities include a relaxed restaurant, and an interior courtyard with an outdoor pool. There's also a kids' play area.",
        "Lat": "-8.700.705.754",
        "Long": "115.178.499",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/ef/31/fa/fame-hotel-sunset-road.jpg?w=900&h=-1&s=1"
    },
    {
        "id": "19",
        "Name": "Ramada Encore by Wyndham Bali Seminyak",
        "Ratings": "4.3",
        "Price": "321,555.00",
        "Addres": "Jl. Dewi Saraswati III, Seminyak, Kec. Kuta, Kota Denpasar, Bali 80361",
        "Coordinate": "-8.685535269703935, 115.17614202158985",
        "Description": "This polished hotel is 2 km from 3D art at DMZ Bali, 3 km from Seminyak Beach and 10 km from Ngurah Rai International Airport. Relaxed, warmly decorated rooms provide minibars, free Wi-Fi and flat-screen TVs, as well as tea and coffeemakers. Suites add living areas. Kids age 17 and under stay at no cost. Room service is available 24/7. A breakfast buffet, parking and an airport shuttle are complimentary. There's an airy, informal restaurant, a cafe and a bar. Other amenities include an outdoor pool and a BBQ area, plus a fitness room, a spa and a business center.",
        "Lat": "-868.553.527",
        "Long": "115.176.142",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/110786796.jpg?k=e94f123de67392b7a537530f07d14393d7acb037630a4b222afe03e3a7468b9c&o=&hp=1"
    },
    {
        "id": "20",
        "Name": "Jambuluwuk Oceano Seminyak Hotel",
        "Ratings": "4.3",
        "Price": "642,249.00",
        "Addres": "Jl. Petitenget No.108, Kerobokan Kelod, Kec. Kuta Utara, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.67654191715343, 115.15566028972788",
        "Description": "Along a bustling street with bars, restaurants and shops, this upscale hotel is 2 km from Seminyak Beach. Serene rooms and suites with modern Balinese decor offer free Wi-Fi and flat-screens; some have balconies. Suites add separate living areas, and some have free-standing soaking tubs. Room service is available. Amenities include 2 outdoor pools, poolside bars and a kids’ pool with a waterslide. The rooftop features an airy restaurant and billiards, and there’s a relaxed bar and restaurant adjacent to the hotel. Other amenities include a spa, a gym, a hair salon and a kids’ play area. A business center and meeting rooms are available.",
        "Lat": "-8.676.541.917",
        "Long": "1.151.556.603",
        "Images": "https://pix10.agoda.net/hotelImages/1517495/-1/d63b54318380ff8a2cd2d5ace380b064.jpg?ca=0&ce=1&s=1024x768"
    },
    {
        "id": "21",
        "Name": "Le Grande Bali",
        "Ratings": "4.2",
        "Price": "596,776.00",
        "Addres": "Blok 5, Pecatu Indah Resort Jalan Raya Uluwatu, Pecatu, Kec. Kuta Sel., Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.80673925578913, 115.13053573164076",
        "Description": "Part of the Pecatu Indah Resort, this upscale hotel is an 8-minute walk from the New Kuta Golf Club, 2 km from Dreamland Beach and 11 km from the cliff-top Uluwatu Temple. Airy rooms feature free Wi-Fi, flat-screen TVs and minifridges, as well as tea and coffeemakers. All have balconies with sofas. Suites add separate living rooms; 2-bedroom suites include 2 bathrooms. Room service is offered 24/7. Breakfast, parking and a local shuttle are free. Other amenities include a relaxed restaurant with a terrace, and 3 outdoor pools. There's also a poolside cocktail bar and a plush open-air spa. Activities such as tennis, golf and cycling are offered.",
        "Lat": "-8.806.739.256",
        "Long": "1.151.305.357",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/10/7e/69/86/le-grande-bali.jpg?w=900&h=-1&s=1"
    },
    {
        "id": "22",
        "Name": "AYANA Resort and Spa, BALI",
        "Ratings": "4.7",
        "Price": "4,048,848.00",
        "Addres": "647Q+GP, Jimbaran, South Kuta, Badung Regency, Bali",
        "Coordinate": "-8.786213290443014, 115.13926384240553",
        "Description": "Perched on a clifftop on the Bukit peninsula, this luxe resort is 6 km from Garuda Wisnu Kencana park and 15 km from Pura Luhur Uluwatu temple. Offering garden or ocean views, the elegant rooms come with carved wooden partitions, free Wi-Fi and flat-screen TVs, plus minibars, balconies, and tea and coffeemaking facilities. Upgraded rooms feature access to a lounge with complimentary food and drinks. Suites add sitting rooms, 4-poster beds and 2-person free-standing tubs. Villas offer plunge pools. Amenities include 9 restaurants, 4 bars and 3 cafes, plus 4 outdoor pools, beach access and tennis courts. There's also a spa and a kids' club.",
        "Lat": "-878.621.329",
        "Long": "1.151.392.638",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0c/ab/0c/15/ayana-upper-pool.jpg?w=1000&h=600&s=1"
    },
    {
        "id": "23",
        "Name": "Wyndham Dreamland Resort Bali",
        "Ratings": "4.4",
        "Price": "Nan",
        "Addres": "Kawasan, Jl. Pecatu Indah Raya Jl. Pantai Dreamland, Pecatu, Kec. Kuta Sel., Kabupaten Badung, Bali 80364",
        "Coordinate": "-8.802186621943733, 115.12036135686262",
        "Description": "Surrounded by trees and overlooking the Indian Ocean, this chic hotel is 9 minutes by foot from Dreamland Beach. It's 18 km from Ngurah Rai International Airport. Polished rooms offer free Wi-Fi, flat-screens and minifridges. All include en suite bathrooms, private balconies and seating areas. Some feature separate bedrooms, ocean views and/or whirlpool tubs. Posh villas add private pools. Room service is available 24/7. Breakfast is available in a restaurant serving international cuisine. There's also a bar, plus an outdoor pool with a cafe. Other amenities include a spa, a gym and a yoga studio, plus a garden, event space and parking.",
        "Lat": "-8.802.186.622",
        "Long": "1.151.203.614",
        "Images": "https://pix10.agoda.net/hotelImages/3545234/-1/46ab3e128e20e040dc7c3c743b9b1f1d.jpg?ca=10&ce=1&s=1024x768"
    },
    {
        "id": "24",
        "Name": "Sheraton Bali Kuta Resort",
        "Ratings": "4.6",
        "Price": "2,320,858.00",
        "Addres": "Jl. Pantai Kuta, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.718277596959451, 115.16957373836593",
        "Description": "Next to Beachwalk shopping mall, this high-end hotel is a minute's walk from Kuta Beach on the Bali Sea and 2 km from lively Jalan Legian. Posh rooms feature free Wi-Fi, iPod docks and flat-screens, plus minibar, coffeemakers, and terraces or balconies. Upgraded rooms add courtyard or sea views, while suites include living/dining areas; an upgraded suite has a rooftop pool. There's 24/7 room service. Kids age 11 and under stay at no charge with an adult. Parking is complimentary. Amenities consist of 2 restaurants, including an upscale Italian option, and a bar, plus a spa, a gym, and an infinity pool with sea views. There's also a kids' club.",
        "Lat": "-8.718.277.597",
        "Long": "1.151.695.737",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/15/9c/2e/8c/sheraton-bali-kuta-resort.jpg?w=900&h=-1&s=1"
    },
    {
        "id": "25",
        "Name": "Merusaka Nusa Dua (formerly INAYA Putri Bali)",
        "Ratings": "4.6",
        "Price": "1,361,340.00",
        "Addres": "Kawasan Wisata Nusa Dua Lot S-3, Benoa, Kec. Kuta Sel., Kabupaten Badung, Bali 80363",
        "Coordinate": "-8.806877156271623, 115.22941539413046",
        "Description": "This polished beachfront resort is 1.5 km from the Bali National Golf Club and 12 km from Garuda Wisnu Kencana Cultural Park, known for its Hindu sculptures. Refined rooms with dark wood furnishings have free Wi-Fi and flat-screen TVs, as well as balconies, seating areas, minibars and rainfall showerheads. Suites – some with ocean views – offer living areas, plus in-room dining and butler services. Villas add sundecks, plunge pools and private beach cabanas. Breakfast and parking are available. The resort has 3 restaurants (1 open-air), a cocktail lounge and a beach bar, in addition to multiple lagoon-style pools.",
        "Lat": "-8.806.877.156",
        "Long": "1.152.294.154",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max500/217056726.jpg?k=b24dfa0342e41a2ac408f0c3a3abf24fdb8a6987b8eee179aa5170c6d20127b6&o=&hp=1"
    },
    {
        "id": "26",
        "Name": "OYO 499 Princess Keisha Hotel & Convention Center",
        "Ratings": "3.9",
        "Price": "Nan",
        "Addres": "Jl. Teuku Umar Barat No.350, Padangsambian, Kec. Denpasar Bar., Kota Denpasar, Bali 80119",
        "Coordinate": "-8.679578854190138, 115.18801874752351",
        "Description": "Set 12 km from Ngurah Rai International Airport, this relaxed hotel is 6 km from both the popular Double Six Beach, and vibrant shopping and nightlife on Jalan Legian. Unpretentious room with warm furnishings offer free Wi-Fi, flat-screen TVs and minibars, plus minifridges and coffeemakers; some add sofabeds. Refined suites with modern decor sleep up to 3 guests and feature chic lounge areas. Breakfast is complimentary. There's a garden, and an outdoor pool with a kids' section. Other amenities include meeting rooms and event space.",
        "Lat": "-8.679.578.854",
        "Long": "1.151.880.187",
        "Images": "https://ik.imagekit.io/tvlk/apr-asset/dgXfoyh24ryQLRcGq00cIdKHRmotrWLNlvG-TxlcLxGkiDwaUSggleJNPRgIHCX6/hotel/asset/10000706-f9e0f3d85ff99c5b31a2262f4d63e479.jpeg?_src=imagekit&tr=c-at_max,h-488,q-40,w-768"
    },
    {
        "id": "27",
        "Name": "Rofa Kuta Hotel",
        "Ratings": "4.1",
        "Price": "177,413.00",
        "Addres": "Jl. Nakula No.9, Legian, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.699314570260176, 115.17956550674633",
        "Description": "Within walking distance of eateries, this informal hotel in an ornate, modern building is 4 minutes' walk from the DMZ Trick Art Museum, 2 km from Double Six Beach and 7 km from I Gusti Ngurah Rai International Airport. Simply furnished rooms with bright wall art provide complimentary Wi-Fi, flat-screen TVs, minibars and safes, plus tea and coffeemaking facilities. Upgraded rooms and suites add furnished balconies; some have sofas and/or quirky vintage-inspired seating. There's a warm restaurant, an outdoor pool and a spa.",
        "Lat": "-869.931.457",
        "Long": "1.151.795.655",
        "Images": "https://new-hls.s3.amazonaws.com/hls/data/3848/website/general/bn/mobile_pool-resize.jpg"
    },
    {
        "id": "28",
        "Name": "Golden Tulip Jineng Resort Bali",
        "Ratings": "4.4",
        "Price": "283,936.00",
        "Addres": "Jl. Sunset Road No.98, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.718416082969146, 115.1836207067463",
        "Description": "In the village center, this upscale hotel is 3 km from Kuta Beach and 13 km from the Garuda Wisnu Kencana Cultural Park. Warmly decorated rooms feature free Wi-Fi and flat-screens, plus minibars, safes, and tea and coffeemakers. Some offer balconies overlooking a lagoon pool. Suites provide living rooms; some include kitchenettes, whirlpool tubs and/or direct pool access. Room service is available 24/7. A breakfast buffet is free. A glass-enclosed eatery serves international cuisine, and there's a casual restaurant/bar next to a lagoon-style pool. Other amenities include a kids' pool and a game room, plus a gym, a spa and a yoga studio.",
        "Lat": "-8.718.416.083",
        "Long": "1.151.836.207",
        "Images": "https://origin.pegipegi.com/jalan/images/pict1L/Y6/Y940766/Y940766003.jpg"
    },
    {
        "id": "29",
        "Name": "Daun Bali Seminyak Hotel",
        "Ratings": "4.4",
        "Price": "322,993.00",
        "Addres": "Jl. Petitenget No.8, Kerobokan Kelod, Kec. Kuta Utara, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.67206881544723, 115.1635807355821",
        "Description": "This polished hotel on a bustling commercial street is 4 km from both Seminyak Beach and DMZ Bali, a 3D art museum, and 12 km from Bali Ngurah Rai International Airport. Featuring chic, neutral decor, the stylish rooms come with free Wi-Fi and smart TVs, as well as minifridges, safes, and tea and coffeemaking facilities. Upgraded rooms have sitting areas, balconies and/or kitchenettes. Room service is available. Amenities include a striking restaurant/bar with contemporary decor, plus an outdoor pool that has an adjacent bar. There's also a spa, and a rooftop terrace featuring a hot tub and a relaxed bar.",
        "Lat": "-8.672.068.815",
        "Long": "1.151.635.807",
        "Images": "https://ik.imagekit.io/tvlk/apr-asset/dgXfoyh24ryQLRcGq00cIdKHRmotrWLNlvG-TxlcLxGkiDwaUSggleJNPRgIHCX6/hotel/asset/10012189-0ed7621ba9695dc83e9acf812b4eeb8f.jpeg?_src=imagekit&tr=c-at_max,h-488,q-40,w-768"
    },
    {
        "id": "30",
        "Name": "Aryaduta Bali",
        "Ratings": "4.6",
        "Price": "631,795.00",
        "Addres": "Jl. Kartika Plaza, Lingkungan Segara, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.735791178046982, 115.16696344118643",
        "Description": "Set next to Lippo Mall Kuta, this polished hotel is a 9-minute walk from Jerman Beach on the Bali Sea and 3 km from Ngurah Rai International Airport. The airy, refined rooms provide Wi-Fi access, flat-screen TVs and safes, plus sitting areas with sofas. Some upgraded rooms are interconnected and/or add balconies. Room service is available. Children age 15 and under stay at no extra cost with an adult. Breakfast is complimentary. There's a hip restaurant and sports bar featuring pinball machines and a pool table. Other amenities include a rooftop pool, a gym and a movie theater. Parking and event space are offered.",
        "Lat": "-8.735.791.178",
        "Long": "1.151.669.634",
        "Images": "https://pwmu.co/wp-content/uploads/2019/11/hotel-bali_EDIT_1.jpg"
    },
    {
        "id": "31",
        "Name": "OYO 1670 Likko Inn",
        "Ratings": "4",
        "Price": "110,306.00",
        "Addres": "Jl. Suli No.11, Dangin Puri Kangin, Kec. Denpasar Utara, Kota Denpasar, Bali 80234",
        "Coordinate": "-8.64802340342829, 115.22289370674633",
        "Description": "A 17-minute walk from the Bali Museum, this down-to-earth budget hotel is 5 km from the Bajra Sandhi Monument and 16 km from Ngurah Rai International Airport. Featuring tile floors, the no-nonsense rooms offer flat-screen TVs, air conditioning and en suite bathrooms, as well as Wi-Fi. There's an outdoor pool and a convenience shop. Parking is available.",
        "Lat": "-8.648.023.403",
        "Long": "1.152.228.937",
        "Images": "https://ik.imagekit.io/tvlk/apr-asset/dgXfoyh24ryQLRcGq00cIdKHRmotrWLNlvG-TxlcLxGkiDwaUSggleJNPRgIHCX6/hotel/asset/20003101-5698f72971e7461b4ea4a8595a2e51f0.jpeg?tr=q-40,c-at_max,w-1280,h-720&_src=imagekit"
    },
    {
        "id": "32",
        "Name": "Coco De Heaven",
        "Ratings": "3.8",
        "Price": "123,505.00",
        "Addres": "Jl. Bypass Ngurah Rai No.17X, Kedonganan, Kec. Kuta Sel., Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.75856147952032, 115.17935147791054",
        "Description": "Nan",
        "Lat": "-875.856.148",
        "Long": "1.151.793.515",
        "Images": "https://img.hotelmurah.com/hotel/myhm_8366_1.jpg"
    },
    {
        "id": "33",
        "Name": "Grand Lifestyle Hotel",
        "Ratings": "3.5",
        "Price": "Nan",
        "Addres": "Jl. Teuku Umar No.175-179, Dauh Puri Kauh, Kec. Denpasar Bar., Kota Denpasar, Bali 80114",
        "Coordinate": "-8.678528738605127, 115.20553593605858",
        "Description": "Nan",
        "Lat": "-8.678.528.739",
        "Long": "1.152.055.359",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/110348877.jpg?k=d235b72ec9f82d9308e0d93d3bf822f47ac85056a048c8015891c6b00f59a575&o=&hp=1"
    },
    {
        "id": "34",
        "Name": "Hard Rock Hotel Bali",
        "Ratings": "4.6",
        "Price": "1,689,076.00",
        "Addres": "Jl. Pantai Kuta, Banjar Pande Mas, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.721666974025217, 115.17075860607434",
        "Description": "Across the street from the beach, this music-themed resort hotel with indigenous architecture is 2 km from the shops at Jalan Legian and 7 km from Waterbom Bali. Bold contemporary rooms feature balconies, flat-screen TVs, daybeds, minibars and free Wi-Fi. Upgraded quarters add Nespresso machines and direct pool access. Suites include living rooms and access to a private bar/lounge; some have home theaters and/or kitchenettes. Some quarters have sea views. Free parking and breakfast are available. There's also a pool, a spa, rock climbing and 7 restaurants/bars, plus a fitness center, a recording studio and a kids' club.",
        "Lat": "-8.721.666.974",
        "Long": "1.151.707.586",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/10/4b/3a/a1/waterslide-at-sand-island.jpg?w=900&h=-1&s=1"
    },
    {
        "id": "35",
        "Name": "Harper Kuta by ASTON",
        "Ratings": "4.3",
        "Price": "348,301.00",
        "Addres": "Jl. Raya Legian No.73, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.718956497574473, 115.17474187791056",
        "Description": "This modern hotel on a bustling shopping road is a 2-minute walk from the Bali Bombing Memorial, 11 minutes on foot from Kuta Beach and 2 km from Waterborn Bali water park. Contemporary rooms with floor-to-ceiling windows feature complimentary Wi-Fi, flat-screen TVs, safes, and tea and coffeemaking facilities. Suites add additional beds, sitting areas, DVD players and free-standing tubs. Room service is available 24 hours. Parking is included, as is breakfast served in an open-air restaurant that has a bar. There's also a spa, an outdoor pool and a kids' pool.",
        "Lat": "-8.718.956.498",
        "Long": "1.151.747.419",
        "Images": "https://media-cdn.tripadvisor.com/media/photo-s/16/81/df/65/exterior.jpg"
    },
    {
        "id": "36",
        "Name": "Hawaii Bali Villa",
        "Ratings": "4.4",
        "Price": "Nan",
        "Addres": "Jl. Tukad Balian No.899X, Sanur, Denpasar Selatan, Kota Denpasar, Bali 80361",
        "Coordinate": "-8.705635555564543, 115.2396031914032",
        "Description": "Nan",
        "Lat": "-8.705.635.556",
        "Long": "1.152.396.032",
        "Images": "https://pix10.agoda.net/hotelImages/686610/-1/e87afe36fc4fda80a2856a9468429e10.jpg?ca=7&ce=1&s=1024x768"
    },
    {
        "id": "37",
        "Name": "Kutabex Beachfront Hotel",
        "Ratings": "4.2",
        "Price": "270,001.00",
        "Addres": "Jalan Pantai Kuta, Banjar Pande Mas, Kuta, Badung Regency, Bali 80361",
        "Coordinate": "-8.72017813579893, 115.1697230261405",
        "Description": "On a buzzy promenade lined with restaurants, this modern hotel is across the street from Kuta Beach on the Indian Ocean and 4 km from 3D art at DMZ Bali. Relaxed rooms provide Wi-Fi, flat-screen TVs and safes, along with minibars, and tea and coffeemaking facilities. Upgraded rooms add sitting areas. A vibrant restaurant and sports bar offers billiards tables and nightly live entertainment. There's also a rooftop bar that offers ocean views and adjoins an outdoor infinity pool. Massages and beauty treatments are available. Breakfast is extra.",
        "Lat": "-8.720.178.136",
        "Long": "115.169.723",
        "Images": "https://origin.pegipegi.com/jalan/images/pict1L/Y6/Y979536/X979536001.jpg"
    },
    {
        "id": "38",
        "Name": "Paditeras Boutique Hotel Seminyak",
        "Ratings": "4.3",
        "Price": "Nan",
        "Addres": "Jl. Lb. Sari No.19, Seminyak, Kec. Kuta Utara, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.676428714184437, 115.15888312201461",
        "Description": "Nan",
        "Lat": "-8.676.428.714",
        "Long": "1.151.588.831",
        "Images": "https://images.trvl-media.com/hotels/10000000/9800000/9795900/9795829/dbb9b66f.jpg?impolicy=resizecrop&rw=670&ra=fit"
    },
    {
        "id": "39",
        "Name": "Fashion Hotel Legian",
        "Ratings": "4.2",
        "Price": "209,203.00",
        "Addres": "Jl. Raya Legian No.121, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.713529277004127, 115.17353064671619",
        "Description": "This modern hotel with a high-fashion theme is 8 minutes on foot from lively Jalan Legian and 1 km from Kuta Beach. It's 7 km from Ngurah Rai International Airport. The sophisticated rooms provide safes, flat-screen TVs and free Wi-Fi, in addition to tea and coffeemaking equipment. Some have balconies. Breakfast and parking are complimentary. Other amenities consist of an outdoor pool, an Italian restaurant, a nightclub, and rooftop hot tubs.",
        "Lat": "-8.713.529.277",
        "Long": "1.151.735.306",
        "Images": "https://ak-d.tripcdn.com/images/0224p120009cob3saE2EF_Z_550_412_R5_Q70_D.jpg"
    },
    {
        "id": "40",
        "Name": "HARRIS Hotel Kuta Galleria",
        "Ratings": "4.3",
        "Price": "316,354.00",
        "Addres": "Jl. Bypass Ngurah Rai No.1, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.721868883263062, 115.18629139325365",
        "Description": "Set on a main thoroughfare 3 minutes' walk from Bali Galeria mall, this colorful, modern hotel with a hip vibe is across the street from a lake and 3 km from lively Kuta Beach. Unfussy rooms with bright contemporary decor provide free Wi-Fi, daybeds and flat-screens along with tea and coffeemakers, minibars and aromatherapy kits. Some offer lake views. Suites add separate living rooms with pull-out sofas. Room service is available 24/7 Amenities include a simple cafe with a terrace and tropical plants, as well as a gym, an outdoor pool and a lobby lounge. There's also a meeting room and a kids' club.",
        "Lat": "-8.721.868.883",
        "Long": "1.151.862.914",
        "Images": "https://pix10.agoda.net/hotelImages/699559/-1/05b97d465a210535b50e514125c919e5.jpg?ca=0&ce=1&s=1024x768"
    },
    {
        "id": "41",
        "Name": "Sthala, a Tribute Portfolio Hotel, Ubud Bali",
        "Ratings": "4.7",
        "Price": "1,190,198.00",
        "Addres": "Jalan A.A Gede Rai, Jl. Raya Mawang Kelod, Lodtunduh, Ubud, Bali 80571",
        "Coordinate": "-8.572468688216045, 115.25964208476907",
        "Description": "Set on a lush riverside property, this upscale hotel with traditional styling is 6 km from both Tegenungan Waterfall and the Agung Rai Museum of Art, and 7 km from the Ubud Monkey Forest. Featuring balconies, the polished rooms come with free high-speed Wi-Fi and flat-screen TVs, plus minibars and kitchenettes; some offer river views. Room service is available 24/7. Parking and a local shuttle are free. There's also an open-air restaurant, a rooftop bar and a poolside bar. Other amenities include 2 outdoor pools, a gym and yoga. Balinese dancing and cooking classes are offered.",
        "Lat": "-8.572.468.688",
        "Long": "1.152.596.421",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/176490590.jpg?k=e2dd72ee448e1d51fa52cb817bc5e94619200621a58b549b9761b2f0efdcfadc&o=&hp=1"
    },
    {
        "id": "42",
        "Name": "Mulia Resort",
        "Ratings": "4.7",
        "Price": "3,668,680.00",
        "Addres": "Kawasan Sawangan, Jl. Raya Nusa Dua Selatan Jl. Nusa Dua, Benoa, Kec. Kuta Sel., Kabupaten Badung, Bali 80363",
        "Coordinate": "-8.815972290633553, 115.22320225092524",
        "Description": "This premium tropical resort, set on the white-sand Nusa Dua Beach along the Bali Sea, is 4 km from Museum Pasifika's art galleries and 9 km from the Bukit Peninsula, a popular surfing spot. Plush rooms with marble floors provide free Wi-Fi, flat-screen TVs and luxe bedding, as well patios or balconies with sea or garden views. Suites add living areas; some have vaulted ceilings. Room service is available. Amenities consist of a hot tub, a gym and a spa, along with 4 outdoor pools, 3 bars and 6 restaurants, including Japanese and Chinese options. Activities such as kayaking, yoga and tennis can be arranged.",
        "Lat": "-8.815.972.291",
        "Long": "1.152.232.023",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/19/a5/f2/d6/mulia-resort.jpg?w=900&h=-1&s=1"
    },
    {
        "id": "43",
        "Name": "J Hotel Kuta",
        "Ratings": "4.2",
        "Price": "170,668.00",
        "Addres": "Jalan Raya Kuta No.88D, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.72919085668914, 115.17697470674632",
        "Description": "",
        "Lat": "-8.729.190.857",
        "Long": "1.151.769.747",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/10/6a/8a/2f/j-hotel-tampak-depan.jpg?w=900&h=-1&s=1"
    },
    {
        "id": "44",
        "Name": "Ivanka Airport Inn",
        "Ratings": "3.6",
        "Price": "172,262.00",
        "Addres": "Jl. Puri Gerenceng No.2, Tuban, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.740948597886979, 115.17254886441789",
        "Description": "Nan",
        "Lat": "-8.740.948.598",
        "Long": "1.151.725.489",
        "Images": "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/10/29/f9b394ae-1ca3-4704-a005-0564086ca139-1603904770412-ed22f83ca2a0b28f8e71b044859f894a.jpg"
    },
    {
        "id": "45",
        "Name": "Singaraja Hotel",
        "Ratings": "4.1",
        "Price": "197,750.00",
        "Addres": "Kp. Baru, Kec. Buleleng, Kabupaten Buleleng, Bali 81113",
        "Coordinate": "-8.102818880869965, 115.09071697121786",
        "Description": "This casual modern hotel on the Bali Sea is 10 km from both lively Lovina Beach and the Aling-Aling waterfall. The streamlined, colorful rooms feature flat-screen TVs and free Wi-Fi, as well as in-room safe deposit boxes. Free breakfast is served in a low-key dining area. The hotel also offers a beachfront pool, as well as a patio with lounge chairs. There's also a meeting room.",
        "Lat": "-8.102.818.881",
        "Long": "115.090.717",
        "Images": "https://www.balipost.com/wp-content/uploads/2019/10/balipostcom_singaraja-hotel-akomodasi-wisata-berkelas-di-kota-singaraja_01-696x464.jpg"
    },
    {
        "id": "46",
        "Name": "Grand Ixora Kuta Resort",
        "Ratings": "4.2",
        "Price": "212,820.00",
        "Addres": "Jl. Kartika Plaza No.92, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.73388498268596, 115.16752952937662",
        "Description": "Set in an angular, modern building, this upscale hotel is 3 km from Ngurah Rai International Airport and 6 km from the upmarket Seminyak district. The vibrant rooms with balconies feature sleek furnishings and provide flat-screen TVs, free Wi-Fi and minifridges, plus tea and coffeemaking facilities. Upgraded rooms add DVD players and seating areas. Parking is free. Other amenities include an airy restaurant, an outdoor pool and bar, and a spa. Babysitting services are available and there's a lounge with guest computers. Activities such as weaving or fruit carving are offered for a fee.",
        "Lat": "-8.733.884.983",
        "Long": "1.151.675.295",
        "Images": "https://imgcy.trivago.com/c_limit,d_dummy.jpeg,f_auto,h_1300,q_auto,w_2000/itemimages/20/48/2048909_v2.jpeg"
    },
    {
        "id": "47",
        "Name": "Bali Nusa Dua Hotel",
        "Ratings": "4.6",
        "Price": "692,608.00",
        "Addres": "Kawasan Pariwisata Nusa Dua Lot NW/1, Benoa, Kec. Kuta Sel., Kabupaten Badung, Bali 80363",
        "Coordinate": "-8.793587395914745, 115.2266589067463",
        "Description": "An 8-minute walk from Pantai Samuh beach, this polished hotel is 2 km from Bali National Golf Club and 12 km from Ngurah Rai International Airport. The streamlined rooms offer free Wi-Fi and flat-screen TVs, plus minibars, and tea and coffeemaking facilities. Suites add separate living areas. Room service is available. An area shuttle is complimentary. Other amenities include a buffet restaurant, an outdoor pool and a fitness room, as well as a spa and a kids’ play area.",
        "Lat": "-8.793.587.396",
        "Long": "1.152.266.589",
        "Images": "https://balinusaduahotel.com/wp-content/uploads/2019/10/balinusaduahotel-lagoon.jpg"
    },
    {
        "id": "48",
        "Name": "Golden Tulip Essential Denpasar",
        "Ratings": "4.2",
        "Price": "181,425.00",
        "Addres": "Jl. Gatot Subroto Barat No.101, Padangsambian Kaja, Kec. Denpasar Bar., Kota Denpasar, Bali 80118",
        "Coordinate": "-8.635958981591507, 115.19312212031377",
        "Description": "Set in the Central Business District, this informal hotel is 2 km from Terminal Bus Ubung and 4 km from Badung Market. Unpretentious rooms have bathrooms with rainfall showerheads, and come with free Wi-Fi, flat-screen TVs, and tea and coffeemaking facilities. There's a casual restaurant with a terrace, as well as a bar. Other amenities include an outdoor pool and a spa.",
        "Lat": "-8.635.958.982",
        "Long": "1.151.931.221",
        "Images": "https://www.kayak.co.id/rimg/himg/b0/8a/bb/ice-25869-7895914_3XL-473399.jpg?width=1366&height=768&crop=true"
    },
    {
        "id": "49",
        "Name": "Negara Hotel",
        "Ratings": "3.8",
        "Price": "201,729.00",
        "Addres": "Jl. Ngurah Rai No.107, Pendem, Kec. Negara, Kabupaten Jembrana, Bali 82218",
        "Coordinate": "-8.360591192592048, 114.62912890674632",
        "Description": "On a bustling commercial street, this simple budget hotel is a 7-minute walk from Negara Bus Terminal and 10 km from Baluk Rening Beach. Basic rooms with modest decor offer Wi-Fi access and flat-screen TVs. Upgraded quarters add bathrooms with hot water, plus tea and coffeemaking equipment; some include safes, minifridges and whirlpool tubs. Parking is complimentary. There's a low-key restaurant, massage services and bike rentals, plus a meeting room.",
        "Lat": "-8.360.591.193",
        "Long": "1.146.291.289",
        "Images": "https://www.indoplaces.com/foto/hotel/jimbarwana-hotel.jpg"
    },
    {
        "id": "50",
        "Name": "The Westin Resort Nusa Dua, Bali\n",
        "Ratings": "4.6",
        "Price": "1,996,448.00",
        "Addres": "Itdc, Kawasan Pariwisata, Jl. Nusa Dua No.3, Bali 80363",
        "Coordinate": "-8.795690793342184, 115.2307301355821",
        "Description": "This luxe, beachfront hotel is 2.9 km from Bali National Golf Club and 14 km from Waterbomb Bali waterpark. Featuring earthy tones and balconies with ocean, pool or garden views, the lavish rooms and suites offer free Wi-Fi, flat-screen TVs and iPod docks. They also have minifridges, coffeemakers and plush sitting areas; some add furnished terraces. Suites have separate sitting and dining areas, some come with private pools. There's 24-hour room service. Amenities include 5 restaurants, a chic bar and an elegant lobby lounge. There’s also a gym, a spa and a kids’ club. Outside are 3 pools, thatched day beds and tennis courts.",
        "Lat": "-8.795.690.793",
        "Long": "1.152.307.301",
        "Images": "https://imgcy.trivago.com/c_limit,d_dummy.jpeg,f_auto,h_1300,q_auto,w_2000/itemimages/93/91/93914_v5.jpeg"
    },
    {
        "id": "51",
        "Name": "Hotel Santika Premiere Jogja",
        "Ratings": "4,5",
        "Price": "518837",
        "Addres": "Jl. Jend. Sudirman No.19, Cokrodiningratan, Kec. Jetis, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55233",
        "Coordinate": "-7.782247404680448, 110.36977385092524",
        "Description": "Among city-center businesses, this upscale hotel is 2 km from the Jalan Malioboro shopping district and 8 km from Adisucipto International Airport. Elegant rooms feature free Wi-Fi and flat-screen TVs, plus minibars, safes, and tea and coffeemakers. Upgraded rooms have balconies. Suites add kitchenettes and living areas. There's 24/7 room service. Kids age 12 and under stay at no charge with an adult. Breakfast and parking are complimentary. Other amenities include 2 restaurants and a coffee shop, plus a business center and a fitness center. There's also a spa, a hot tub and an outdoor pool, as well as an airport shuttle.",
        "Lat": "-7.782.247.405",
        "Long": "1.103.697.739",
        "Images": "https://exp.cdn-hotels.com/hotels/1000000/530000/523700/523641/7820558b_z.jpg?impolicy=fcrop&w=773&h=530&q=high"
    },
    {
        "id": "52",
        "Name": "Hotel Surya Putri by RedDoorz",
        "Ratings": "3,5",
        "Price": "",
        "Addres": "Jl. Tukangan No.29, Tegal Panggung, Kec. Danurejan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55212",
        "Coordinate": "-7.791973498064445, 110.3718665644179",
        "Description": "",
        "Lat": "-7.791.973.498",
        "Long": "1.103.718.666",
        "Images": "https://media-cdn.tripadvisor.com/media/photo-m/1280/17/14/0b/74/profile-hotel-surya-putri.jpg"
    },
    {
        "id": "53",
        "Name": "Hotel Tentrem",
        "Ratings": "4,7",
        "Price": "1446717",
        "Addres": "Jl. P. Mangkubumi No.72A, Cokrodiningratan, Kec. Jetis, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55233",
        "Coordinate": "-7.773544228912884, 110.36841849140322",
        "Description": "Among shops and restaurants, this lavish hotel is 2.9 km from the markets on buzzy Jalan Malioboro, and 5 km from Keraton Ngayogyakarta Hadiningrat palace. Plush, modern rooms offer free Wi-Fi and flat-screen TVs, plus minibars, and tea and coffeemakers. Upgraded rooms have balconies; studios and 1- to 2-bedroom suites add living areas and/or whirlpool tubs. An upgraded suite offers a kitchenette, a powder room and 24/7 butler service. A breakfast buffet and parking are complimentary. Other amenities include 2 upscale restaurants and a polished lounge, plus an outdoor pool with a poolside bar. There’s also a spa, a gym and a boutique.",
        "Lat": "-7.773.544.229",
        "Long": "1.103.684.185",
        "Images": "https://d2ile4x3f22snf.cloudfront.net/wp-content/uploads/sites/210/2017/11/26090747/2200-1200-Pool-21.jpg"
    },
    {
        "id": "54",
        "Name": "Unisi Yogyakarta Syariah",
        "Ratings": "4",
        "Price": "323086",
        "Addres": "Jl. Ps. Kembang No.42, Sosromenduran, Gedong Tengen, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55271",
        "Coordinate": "-7.789913899137515, 110.36382106441789",
        "Description": "On a bustling street in the city center, this casual budget hotel is an 8-minute walk from both Jogjakarta train station and Jalan Malioboro, a major shopping street. Featuring photographic wall murals, the cozy rooms come with free Wi-Fi, flat-screen TVs, and tea and coffeemaking facilities. Room service is available 24/7. There's a relaxed restaurant.",
        "Lat": "-7.789.913.899",
        "Long": "1.103.638.211",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1280x900/228968096.jpg?k=22b3478251f38d394e5a8a8894fa256f9b4670ac32477fc9bfa9a082368607a9&o=&hp=1"
    },
    {
        "id": "55",
        "Name": "Hotel Winotosastro Garden",
        "Ratings": "3",
        "Price": "270000",
        "Addres": "Jl. Sartono, Mantrijeron, Kec. Mantrijeron, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55143",
        "Coordinate": "-7.819625916892901, 110.36720525092522",
        "Description": "Set in a colorful building on a downtown street, this laid-back hotel is a 13-minute walk from a transit stop, 2 km from the 18th-century gardens at Taman Sari, and 4 km from shopping and dining at Jalan Malioboro. Unfussy rooms come with free Wi-Fi, plus TVs, and balconies or terraces. Family rooms are available. Free perks include a breakfast buffet and parking. Other amenities include a courtyard garden with seating areas, in addition to a laundry, and a cafe with a terrace. Reception is available 24/7.",
        "Lat": "-7.819.625.917",
        "Long": "1.103.672.053",
        "Images": "https://d39wptbp5at4nd.cloudfront.net/media/61335_original_(Lowongan_Kerja)_Dicari_KaryawanKaryawati_Untuk_Housekeeping_dan_Tukang_Masak_di_Hotel_Winotosastro_Garden_Yogyakarta_(Walk_in_Interview__Wawancara_Langsung).JPG"
    },
    {
        "id": "56",
        "Name": "Indies Heritage Hotel Prawirotaman Yogyakarta",
        "Ratings": "4",
        "Price": "361538",
        "Addres": "Jl. Prawirotaman 3 Timuran No.3, Brontokusuman, Kec. Mergangsan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55153",
        "Coordinate": "-7.820338630179709, 110.36953179325367",
        "Description": "Set in a stately building, this elegant, Colonial-style hotel is 3 km from Keraton Ngayogyakarta Hadiningrat, an 18th-century palace, and 12 km from Adisutjipto International Airport. The polished rooms come with Wi-Fi, flat-screen TVs and safes, plus tea and coffeemaking facilities. Upgraded rooms provide furnished balconies. Suites have minibars, and living areas with sofabeds. Room service is available. Breakfast is available. There's a restaurant and an outdoor pool.",
        "Lat": "-782.033.863",
        "Long": "1.103.695.318",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/62392585.jpg?k=78f2b4a65ad5094d4e100a06e1be81a39ab2bb9fd5348bc0fd803632158753c4&o=&hp=1"
    },
    {
        "id": "57",
        "Name": "Jambuluwuk Malioboro Hotel Yogyakarta",
        "Ratings": "3,8",
        "Price": "499380",
        "Addres": "Jl. Gajah Mada No.67, Purwokinanti, Pakualaman, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55166",
        "Coordinate": "-7.797358681375238, 110.37256902393989",
        "Description": "Set in the downtown area, this modern hotel is a 14-minute walk from the Jalan Malioboro shopping district and the Fort Vredeburg Museum, and 9 km from Adisucipto International Airport. The sophisticated rooms provide minibars, free Wi-Fi and satellite TV, plus tea and coffeemakers. Upgraded rooms and suites add city views, dining areas and/or separate living rooms. Room service is available 24/7. Airport transfers are free. There's a full-service spa, a gym, and a pool surrounded by tropical greenery. Other amenities include a coffee shop, an open-air bistro and a lounge with live music, along with a karaoke lounge.",
        "Lat": "-7.797.358.681",
        "Long": "110.372.569",
        "Images": "https://ik.imagekit.io/tvlk/apr-asset/dgXfoyh24ryQLRcGq00cIdKHRmotrWLNlvG-TxlcLxGkiDwaUSggleJNPRgIHCX6/hotel/asset/10003449-1200x1006-FIT_AND_TRIM-da98526eb383abd8c3dc21f3d4caffc0.jpeg?tr=q-40,c-at_max,w-1280,h-720&_src=imagekit"
    },
    {
        "id": "58",
        "Name": "Kalya Hotel Yogyakarta",
        "Ratings": "4",
        "Price": "229376",
        "Addres": "Jl. Gedongkuning No.118, Rejowinangun, Kec. Kotagede, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55171",
        "Coordinate": "-7.813321930025307, 110.40139140674631",
        "Description": "A 13-minute walk from the Kotagede historic district, this modern budget hotel is 7 km from the Taman Sari former royal gardens, and 6 km from the colonial-era Fort Vredeburg Museum. Slick rooms with colorful decor feature flat-screen TVs and free Wi-Fi, as well as work desks. There's a contemporary lounge area, and an outdoor pool with a sundeck. Breakfast and parking are offered for a surcharge.",
        "Lat": "-781.332.193",
        "Long": "1.104.013.914",
        "Images": "https://pix10.agoda.net/hotelImages/1094103/-1/c68b58868cb7337ef9025637c035e7de.jpg?ca=7&ce=1&s=1024x768"
    },
    {
        "id": "59",
        "Name": "Kampoeng Djawa Guesthouse",
        "Ratings": "3,5",
        "Price": "166250",
        "Addres": "Jl. Prawirotaman No.1 No.40, Brontokusuman, Kec. Mergangsan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55153",
        "Coordinate": "-7.819169742163702, 110.37257920674631",
        "Description": "",
        "Lat": "-7.819.169.742",
        "Long": "1.103.725.792",
        "Images": "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2021/05/28/617ac79c-2132-49d3-aa2b-12c76b35bdb7-1622166312040-e7f3a0cc0780a07c1dea2929f99bc3fb.jpg"
    },
    {
        "id": "60",
        "Name": "Ki Agung Prestise Hotel",
        "Ratings": "3",
        "Price": "117810",
        "Addres": "Jl. Gerilya No.596A, Brontokusuman, Kec. Mergangsan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55153",
        "Coordinate": "-7.819776585489472, 110.36923099528273",
        "Description": "",
        "Lat": "-7.819.776.585",
        "Long": "110.369.231",
        "Images": "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/10/28/124fe366-36f9-4eda-a906-e621011af2c7-1603900169487-fae0080070a8a9c61a649cd035cd12f2.jpg"
    }
]