{
    "1": {
        "id": "1",
        "Name": "Artotel Suites Bianti Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "5.0",
        "Price": "625000",
        "Addres": "Jl. Urip Sumoharjo No.37, Klitren, Kec. Gondokusuman, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55222",
        "Coordinate": "-7.782655534201323, 110.38190546790418",
        "Description": "Set among shops in the city center and offering views of Mount Merapi, this polished hotel is 18 minutes' walk from Lempuyangan train station, 3 km from eateries along Malioboro Street and 5 km from the Palace of Yogyakarta. Chic rooms feature Wi-Fi, TVs and minibars, as well as floor-to-ceiling windows, and tea and coffeemakers. Suites have sitting areas and/or mountain views; an upgraded suite provides a separate living/dining room with a pull-out sofa. Amenities include a restaurant and a rooftop lounge/bar, plus a spa, an outdoor pool and a gym. Breakfast is available.",
        "Lat": "-7.782655534",
        "Long": "110.3819055",
        "Images": "https://asset.kompas.com/crops/bcek5vqNPwTfaELCW3sLgwNhrPM=/10x48:1190x835/750x500/data/photo/2021/12/03/61aa32e0589ba.png"
    },
    "2": {
        "id": "2",
        "Name": "The Phoenix Hotel Yogyakarta - MGallery Collection",
        "Kota": "Yogyakarta",
        "Ratings": "4.5",
        "Price": "735390",
        "Addres": "Jl. Jend. Sudirman No.9, Cokrodiningratan, Kec. Jetis, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55233",
        "Coordinate": "-7.782368072882206, 110.36852501265078",
        "Description": "Set in a colonial building dating from 1918, this refined hotel is 2.1 km from the shops and restaurants of Jalan Malioboro, and 4 km from the 18th-century palace of Kraton Ngayogyakarta Hadiningrat. Featuring traditional Indonesian decor, the elegant rooms offer free Wi-Fi and flat-screen TVs. Upgraded rooms add coffeemakers and minibars; suites include separate living rooms. Cribs are available, and room service is offered. Parking is free. Other facilities include a cosy wine bar, an open-air bar with a fountain, and a genteel, international restaurant with chandeliers. There’s also a spa, a gym, and an outdoor pool in an inner courtyard.",
        "Lat": "-7.782368073",
        "Long": "110.368525",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1280x900/31386929.jpg?k=e9f061d50c308dcd10094913f654f2b49d9f00b29e48caacf04588cb1d527f0d&o=&hp=1"
    },
    "3": {
        "id": "3",
        "Name": "Hotel New Saphir Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "3.5",
        "Price": "398160",
        "Addres": "Jl. Laksda Adisucipto No.38, Demangan, Kec. Gondokusuman, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55221",
        "Coordinate": "-7.783321134572196, 110.3914155390688",
        "Description": "This chic, palm-tree fronted hotel with views of Mount Merapi is 2 km from Lempuyangan train station and 4 km from the shopping of Jalan Malioboro. The upscale rooms and suites feature free Wi-Fi, flat-screens, and tea and coffeemakers. Some have sofas and/or mountain or pool views, and suites add extra bathrooms and living rooms with TVs; some have dining areas. An upgraded suite has a dining room and a pantry, as well as a complimentary butler service. Room service is offered 24/7. There's free continental breakfast and parking. Other amenities include a restaurant, a gym and an outdoor pool, as well as a bar, a tennis court and a ballroom.",
        "Lat": "-7.783321135",
        "Long": "110.3914155",
        "Images": "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/10/31/785293e5-2c4d-4a25-8b34-5b4f8d3d4d1a-1604161009913-6410882aa83e38dbcbb075949da221c0.jpg"
    },
    "4": {
        "id": "4",
        "Name": "Lafayette Boutique Hotel Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "4.5",
        "Price": "649366",
        "Addres": "Manggung, Caturtunggal, Kec. Depok, Kabupaten Sleman, Daerah Istimewa Yogyakarta 55281",
        "Coordinate": "-7.759268574181231, 110.38734472557458",
        "Description": "In a bustling commercial area, this upscale, stately hotel is 6 km from the Jalan Malioboro shopping area and 8 km from Adisucipto International Airport. Ornate rooms offer free Wi-Fi, smart TVs, minibars and sitting areas; some add views of Mount Merapi and lounge access. A 1-bedroom penthouse suite adds a kitchenette, city views and a soaking tub. There's a stylish restaurant, along with a chic rooftop bar that features panoramic views of the city. Other amenities include a gym, and an outdoor infinity pool with mountain views. Event space is available.",
        "Lat": "-7.759268574",
        "Long": "110.3873447",
        "Images": "https://ik.imagekit.io/tvlk/apr-asset/dgXfoyh24ryQLRcGq00cIdKHRmotrWLNlvG-TxlcLxGkiDwaUSggleJNPRgIHCX6/hotel/asset/10014429-49ae67b654f13c6b5a1e01cd63dcd22b.jpeg?_src=imagekit&tr=c-at_max,h-488,q-40,w-768"
    },
    "5": {
        "id": "5",
        "Name": "Grand Mercure Yogyakarta Adi Sucipto",
        "Kota": "Yogyakarta",
        "Ratings": "4.5",
        "Price": "532784",
        "Addres": "Jl. Laksda Adisucipto No.80, Demangan Baru, Caturtunggal, Sleman, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55281",
        "Coordinate": "-7.783529869615401, 110.39236054584215",
        "Description": "Set in a commercial area and offering views of the surrounding mountains, this upmarket hotel is 5 km from both Maguwo train station and Jalan Malioboro, a bustling road with shops, street performers and food stalls. Chic rooms feature free Wi-Fi, flat-screen TVs and minifridges; some come with balconies, mountain views and/or access to a private lounge. Kids age 12 and under (up to 2 per room) stay at no charge with a parent. Room service is available 24/7. Parking and a shuttle to Jalan Malioboro are free. There's also an airy international restaurant and a cozy cocktail lounge, along with a gym and an outdoor pool.",
        "Lat": "-7.78352987",
        "Long": "110.3923605",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1280x900/171570139.jpg?k=e7a767774c24f4950f9d32db044ccddfbb9f78d36717388bfd12fd64d672954d&o=&hp=1"
    },
    "6": {
        "id": "6",
        "Name": "Grand Keisha Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "4.5",
        "Price": "426465",
        "Addres": "Jl. Affandi No.9, Gejayan, Condongcatur, Kec. Depok, Kabupaten Sleman, Daerah Istimewa Yogyakarta 55283",
        "Coordinate": "-7.758822174533065, 110.39599013936483",
        "Description": "Set in a commercial area, this relaxed hotel is 5 km from Jogja Bay, 6 km from the Monument Yogya Kembali and 4 km from the Affandi Museum. Stylish rooms feature free Wi-Fi and flat-screen TVs, plus minibars, and tea and coffeemaking facilities. They also have bathrooms with rainfall showers; suites add living areas. Room service is available. There's an elegant restaurant serving regional cuisine, plus 2 lounges, including a warm 9th-floor lounge with city views. Additional amenities include an outdoor pool, a gym and a ballroom.",
        "Lat": "-7.758822175",
        "Long": "110.3959901",
        "Images": "https://origin.pegipegi.com/jalan/images/pict1L/Y5/Y910795/Y910795055.jpg"
    },
    "7": {
        "id": "7",
        "Name": "THE 1O1 Yogyakarta Tugu",
        "Kota": "Yogyakarta",
        "Ratings": "4.5",
        "Price": "546623",
        "Addres": "Jl. Margo Utomo No.103, Gowongan, Kec. Jetis, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55232",
        "Coordinate": "-7.783731809214222, 110.36634407031661",
        "Description": "Surrounded by city center shops and dining, this trendy hotel with views of the Mount Merapi is 12 minutes' walk from both Stasiun Yogyakarta train station and Jalan Malioboro, a bustling shopping street. Bright rooms provide free Wi-Fi, flat-screen TVs and balconies, plus tea and coffeemaking facilities. Upgraded rooms add mountain views or pool access; suites have sitting areas. Room service is available 24/7. Parking is free. There's an airy cafe with floor-to-ceiling windows that has seating next to an outdoor pool, plus a relaxed lounge bar with a terrace. Other amenities include a gym and massage services. Meeting rooms are available.",
        "Lat": "-7.783731809",
        "Long": "110.3663441",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/16/6c/c4/90/the-1o1-yogyakarta-tugu.jpg?w=900&h=-1&s=1"
    },
    "8": {
        "id": "8",
        "Name": "Nueve Malioboro Hotel Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "178385",
        "Addres": "Mataram St No.9, Suryatmajan, Danurejan, Yogyakarta City, Special Region of Yogyakarta 55213",
        "Coordinate": "-7.795818393844755, 110.36887526221052",
        "Description": "A 7-minute walk from open-air shops and eateries along Jalan Malioboro, this laid-back hotel is 2 km from Kraton Ngayogyakarta Hadiningrat, an 18th-century palace complex and royal residence, and 9 km from Adisucipto International Airport. Unfussy rooms feature flat-screen TVs and free Wi-Fi, as well as en suite, shower-only bathrooms. Some offer tea and coffeemakers, and safes. Upgraded rooms add sitting areas and minibars. Room service is available 24/7. Along with parking, a breakfast buffet is complimentary. Other amenities include a relaxed restaurant, an outdoor pool and meeting facilities, plus bicycle rentals.",
        "Lat": "-7.795818394",
        "Long": "110.3688753",
        "Images": "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/10/28/7a982422-8875-48e8-9e31-baad5a6599df-1603897996616-f41a074ea28f126bee697530bfc83ba1.jpg"
    },
    "9": {
        "id": "9",
        "Name": "Artotel Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "4.5",
        "Price": "427554",
        "Addres": "Jalan Kaliurang KM. 5,6 No.14, Manggung, Caturtunggal, Kabupaten Sleman, Daerah Istimewa Yogyakarta 55281",
        "Coordinate": "-7.756432970876404, 110.3822591189231",
        "Description": "On a commercial street, this trendy, art-filled hotel with an indoor slide is 6 km from the Museum Affandi and 9 km from Adisucipto International Airport. Featuring vibrant wall art, the relaxed, modern rooms have free Wi-Fi, flat-screen TVs, minifridges and coffeemakers. Upgraded rooms add living areas. Room service is available 24/7. Amenities include an informal 24-hour restaurant, a rooftop bar and an outdoor pool.",
        "Lat": "-7.756432971",
        "Long": "110.3822591",
        "Images": "http://pix10.agoda.net/hotelImages/3582399/-1/b8cc3b57f28a2854d84edabb652ce4d0.jpg?ca=7&ce=1&s=768x1024"
    },
    "10": {
        "id": "10",
        "Name": "Hotel Citradream Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "252220",
        "Addres": "Jl. A.M. Sangaji No.28, Cokrodiningratan, Kec. Jetis, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55233",
        "Coordinate": "-7.779803129874829, 110.36766580647142",
        "Description": "This laid-back hotel in a colorful building is 2 km from the lively Jalan Malioboro shopping district, and 4 km from Keraton Ngayogyakarta Hadiningrat, an 18th-century royal palace. Simply furnished rooms come with complimentary Wi-Fi, flat-screen TVs and safes. Complimentary perks include parking, and hot breakfast served in a vibrant dining room. Meeting space is available.",
        "Lat": "-7.77980313",
        "Long": "110.3676658",
        "Images": "http://pix10.agoda.net/hotelImages/782922/-1/9dfdabc49e0b60ea794e7600c70d3e23.jpg?ca=9&ce=1&s=768x1024"
    },
    "11": {
        "id": "11",
        "Name": "Abadi Hotel Malioboro Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "429715",
        "Addres": "Jl. Ps. Kembang No.49, Sosromenduran, Gedong Tengen, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55271",
        "Coordinate": "-7.7896975706096745, 110.36334059555996",
        "Description": "A minute's walk from Stasiun Yogyakarta, this informal hotel is also an 11-minute walk from Jalan Malioboro shopping district and 3 km from The Palace of Yogyakarta. Relaxed rooms offer flat-screen TVs, in addition to tea and coffeemaking facilities. Suites add sitting rooms. Wi-Fi and room service are available. A 24-hour coffee shop serves both European and local cuisine. There's also an outdoor pool, a spa and banquet facilities.",
        "Lat": "-7.789697571",
        "Long": "110.3633406",
        "Images": "https://origin.pegipegi.com/jalan/images/pict1L/Y7/Y927237/Y927237100.jpg"
    },
    "12": {
        "id": "12",
        "Name": "Jambuluwuk Malioboro Yogyakarta Hotel",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "499380",
        "Addres": "Jl. Gajah Mada No.67, Purwokinanti, Pakualaman, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55166",
        "Coordinate": "-7.796896691324248, 110.37261063912776",
        "Description": "Set in the downtown area, this modern hotel is a 14-minute walk from the Jalan Malioboro shopping district and the Fort Vredeburg Museum, and 9 km from Adisucipto International Airport. The sophisticated rooms provide minibars, free Wi-Fi and satellite TV, plus tea and coffeemakers. Upgraded rooms and suites add city views, dining areas and/or separate living rooms. Room service is available 24/7. Airport transfers are free. There's a full-service spa, a gym, and a pool surrounded by tropical greenery. Other amenities include a coffee shop, an open-air bistro and a lounge with live music, along with a karaoke lounge.",
        "Lat": "-7.796896691",
        "Long": "110.3726106",
        "Images": "https://ik.imagekit.io/tvlk/apr-asset/dgXfoyh24ryQLRcGq00cIdKHRmotrWLNlvG-TxlcLxGkiDwaUSggleJNPRgIHCX6/hotel/asset/10003449-1200x1006-FIT_AND_TRIM-da98526eb383abd8c3dc21f3d4caffc0.jpeg?tr=q-40,c-at_max,w-1280,h-720&_src=imagekit"
    },
    "13": {
        "id": "13",
        "Name": "H Boutique Hotel Jogjakarta",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "293523",
        "Addres": "Jl. Prof. Herman Yohanes No.1, Terban, Kec. Gondokusuman, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55223",
        "Coordinate": "-7.780732773879161, 110.37942896029121",
        "Description": "Surrounded by shops and eateries, this understated hotel in the city center is 5 km from the 18th-century Palace of Yogyakarta and a 16-minute walk from Lempuyangan train station. Streamlined rooms and suites feature free Wi-Fi and flat-screen TVs; some add sitting areas and minifridges. Amenities include a bar and a restaurant with a terrace. There's also meeting and event space. Parking is available.",
        "Lat": "-7.780732774",
        "Long": "110.379429",
        "Images": "https://origin.pegipegi.com/jalan/images/pict1L/Y2/Y946912/Y946912129.jpg"
    },
    "14": {
        "id": "14",
        "Name": "Grand Kangen Hotel Urip Sumoharjo",
        "Kota": "Yogyakarta",
        "Ratings": "4.5",
        "Price": "321691",
        "Addres": "Jl. Urip Sumoharjo No.137, Klitren, Kec. Gondokusuman, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55222",
        "Coordinate": "-7.782379655486281, 110.38685292413977",
        "Description": "On a main road in an area with shops and eateries, this informal hotel is 2 km from Tugu, an 1889 landmark monument. It's 3 km from Yogyakarta train station and 5 km from the Palace of Yogyakarta. The unpretentious rooms have Wi-Fi, flat-screen TVs and minifridges, plus tea and coffeemaking facilities. Suites add separate living rooms. Amenities include an indoor pool and a spa, as well as a warmly decorated, casual restaurant and a cozy cafe. Breakfast is available.",
        "Lat": "-7.782379655",
        "Long": "110.3868529",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1280x900/339007866.jpg?k=62a44f2db55367c7abd619fa0fa4e4e7e02a7b64a0859adde82961497521f88b&o=&hp=1"
    },
    "15": {
        "id": "15",
        "Name": "Horaios Malioboro Hotel",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "208612",
        "Addres": "Jl. Gowongan Kidul No.57, Sosromenduran, Gedong Tengen, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55271",
        "Coordinate": "-7.786679419612421, 110.36356230674681",
        "Description": "An 11-minute walk from the shops and restaurants on bustling Jalan Malioboro, this informal hotel is 4 km from Keraton Ngayogyakarta Hadiningrat, an 18th-century royal palace, and 9 km from Adisucipto International Airport. Polished rooms have free Wi-Fi, flat-screen TVs and coffeemakers; some offer city views. Suites add balconies, minifridges and separate living areas. Family suites sleep up to 4. Room service is available 24/7. Parking is complimentary. There’s a casual coffee shop and a restaurant, along with a courtyard patio. An airport shuttle, bike rentals and massage treatments are offered for a fee.",
        "Lat": "-7.78667942",
        "Long": "110.3635623",
        "Images": "https://origin.pegipegi.com/jalan/images/pict1L/Y8/Y925878/Y925878041.jpg"
    },
    "16": {
        "id": "16",
        "Name": "Hotel Adilla Syariah Ambarukmo",
        "Kota": "Yogyakarta",
        "Ratings": "3.5",
        "Price": "173264",
        "Addres": "Jl. Nogorojo No.15, Ambarukmo, Caturtunggal, Kec. Depok, Kabupaten Bantul, Daerah Istimewa Yogyakarta 55198",
        "Coordinate": "-7.7861430034442245, 110.3993152520004",
        "Description": "",
        "Lat": "-7.786143003",
        "Long": "110.3993153",
        "Images": "https://www.gudeg.net/cni-content/uploads/modules/direktori/logo/20160831095112.jpg"
    },
    "17": {
        "id": "17",
        "Name": "Malioboro Prime Hotel",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "342000",
        "Addres": "Jl. Ps. Kembang No.9, Sosromenduran, Gedong Tengen, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55271",
        "Coordinate": "-7.789793884154045, 110.36519536441774",
        "Description": "Across the road from Yogyakarta train station, this laid-back hotel is a 4-minute walk from the street performances and casual eateries along Jalan Malioboro, and 3 km from the Palace of Yogyakarta. Streamlined rooms with tile floors feature flat-screen TVs, Wi-Fi and kettles; some have sitting areas. There's also room service. Amenities include a restaurant, a business center and meeting space. Breakfast and parking are available.",
        "Lat": "-7.789793884",
        "Long": "110.3651954",
        "Images": "https://t-2.tstatic.net/tribunnewswiki/foto/bank/images/whiz-prime-malioboro-yogyakarta2.jpg"
    },
    "18": {
        "id": "18",
        "Name": "Yogyakarta Marriott Hotel",
        "Kota": "Yogyakarta",
        "Ratings": "4.5",
        "Price": "1162416",
        "Addres": "Jl. Ring Road Utara, Kaliwaru, Condongcatur, Kec. Depok, Kabupaten Sleman, Daerah Istimewa Yogyakarta 55283",
        "Coordinate": "-7.761683019744237, 110.39842536441776",
        "Description": "In a modern building lined with palm trees, this elegant hotel is 7 km from the Jogja Expo Center and 8 km from Yogyakarta Adisucipto International Airport. Stylish rooms with city or pool views include free Wi-Fi, flat-screens and minifridges, as well as tea and coffeemakers, and marble bathrooms; some offer sofabeds. Upgraded rooms provide access to a lounge serving breakfast and snacks. Suites add separate living rooms. Room service is available 24/7. Parking is complimentary. There are 3 restaurants; 1 offers Mediterranean cuisine and outdoor seating. Other amenities include an indoor/outdoor pool, along with a a spa and a fitness center.",
        "Lat": "-7.76168302",
        "Long": "110.3984254",
        "Images": "https://q-xx.bstatic.com/xdata/images/hotel/840x460/132604129.jpg?k=3e6c2bc3ec4de198a3f112b8975c45191789ad516a917c32a275afd95e9e705f&o="
    },
    "19": {
        "id": "19",
        "Name": "Ibis Yogyakarta Malioboro Hotel",
        "Kota": "Yogyakarta",
        "Ratings": "4.5",
        "Price": "444233",
        "Addres": "Jl. Malioboro No.52-58, Suryatmajan, Kec. Danurejan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55001",
        "Coordinate": "-7.7929863455848984, 110.36627852024027",
        "Description": "This budget hotel in Yogyakarta's central business district is a minute's walk from the shops on lively Jalan Malioboro and 1.6 km from Kraton Ngayogyakarta Hadiningrat, an 18th-century royal residence. The simple, modern rooms feature free Wi-Fi, satellite TV, and tea and coffeemaking facilities, as well as minifridges. Room service is available. Amenities include a modern restaurant serving international cuisine, and a bar offering drinks and snacks. There's also an outdoor pool and a fitness room.",
        "Lat": "-7.792986346",
        "Long": "110.3662785",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/04/9b/68/hotel-ibis-yogyakarta.jpg?w=900&h=-1&s=1"
    },
    "20": {
        "id": "20",
        "Name": "Hotel Dafam Fortuna Malioboro",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "390023",
        "Addres": "Jl. Malioboro Jl. Dagen No.60, Sosromenduran, Gedong Tengen, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55271",
        "Coordinate": "-7.793148669790788, 110.36291408822846",
        "Description": "This stylish hotel in a colorful building is a 6-minute walk from high-end shopping at Jalan Malioboro, and 3 km each from the 18th-century Palace of Yogyakarta and the royal gardens at Taman Sari. Bright, informal rooms offer free Wi-Fi, flat-screen TVs and coffeemakers. A top-floor suite features a separate living area and direct pool access. There's a chic restaurant and a spa, as well as a rooftop terrace with a pool and a bar.",
        "Lat": "-7.79314867",
        "Long": "110.3629141",
        "Images": "https://uploads-ssl.webflow.com/5d24516960878d9e7f570fca/5f682d136f075b45e2f4cd48_HDFMY-facade.jpg"
    },
    "21": {
        "id": "21",
        "Name": "Hotel Unisi Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "323086",
        "Addres": "Jl. Ps. Kembang No.42, Sosromenduran, Gedong Tengen, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55271",
        "Coordinate": "-7.789924528964478, 110.36377814907478",
        "Description": "On a bustling street in the city center, this casual budget hotel is an 8-minute walk from both Jogjakarta train station and Jalan Malioboro, a major shopping street. Featuring photographic wall murals, the cozy rooms come with free Wi-Fi, flat-screen TVs, and tea and coffeemaking facilities. Room service is available 24/7. There's a relaxed restaurant.",
        "Lat": "-7.789924529",
        "Long": "110.3637781",
        "Images": "https://ticmpu.id/wp-content/uploads/job-manager-uploads/company_logo/2021/10/cer1.jpeg"
    },
    "22": {
        "id": "22",
        "Name": "Hotel Tentrem Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "4.5",
        "Price": "1446717",
        "Addres": "Jl. P. Mangkubumi No.72A, Cokrodiningratan, Kec. Jetis, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55233",
        "Coordinate": "-7.77360801036089, 110.36841849140322",
        "Description": "Among shops and restaurants, this lavish hotel is 2.9 km from the markets on buzzy Jalan Malioboro, and 5 km from Keraton Ngayogyakarta Hadiningrat palace. Plush, modern rooms offer free Wi-Fi and flat-screen TVs, plus minibars, and tea and coffeemakers. Upgraded rooms have balconies; studios and 1- to 2-bedroom suites add living areas and/or whirlpool tubs. An upgraded suite offers a kitchenette, a powder room and 24/7 butler service. A breakfast buffet and parking are complimentary. Other amenities include 2 upscale restaurants and a polished lounge, plus an outdoor pool with a poolside bar. There’s also a spa, a gym and a boutique.",
        "Lat": "-7.77360801",
        "Long": "110.3684185",
        "Images": "https://d2ile4x3f22snf.cloudfront.net/wp-content/uploads/sites/210/2017/11/26090747/2200-1200-Pool-21.jpg"
    },
    "23": {
        "id": "23",
        "Name": "Grand Inna Malioboro",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "567719",
        "Addres": "Jl. Malioboro No.60, Suryatmajan, Kec. Danurejan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55213",
        "Coordinate": "-7.790545359124181, 110.36693470674632",
        "Description": "This stately hotel is 2 km from 18th-century Kraton Ngayogyakarta Hadiningrat palace, 5 km from shopping at Ambarrukmo Plaza and a 15-minute walk from Fort Vredeburg Museum, a former colonial fortress. The elegant rooms and suites feature free Wi-Fi, flat-screen TVs and minifridges. Room service is also available. Amenities include 3 restaurants and a lounge, as well as a spa, an outdoor pool with a terrace, and 18 meeting rooms.",
        "Lat": "-7.790545359",
        "Long": "110.3669347",
        "Images": "https://www.innagroup.co.id/storage//Le7b45Fw.jpeg.png"
    },
    "24": {
        "id": "24",
        "Name": "Porta by The Ambarrukmo",
        "Kota": "Yogyakarta",
        "Ratings": "5.0",
        "Price": "454445",
        "Addres": "Jl. Colombo Yogyakarta No.7, RT.01/RW.01, Samirono, Caturtunggal, Kec. Depok, Kabupaten Sleman, Daerah Istimewa Yogyakarta 55281",
        "Coordinate": "-7.776544281650621, 110.38230977791055",
        "Description": "Set along a main road, this refined hotel with a glass exterior is 2 km from the striking Affandi Museum and 4 km from Beringharjo Market, dating from 1758. It's also 7 km from Adisucipto International Airport. Relaxed rooms with sleek furnishings offer Wi-Fi, flat-screen TVs, and tea and coffeemaking facilities, plus minibars and desks. Upgraded rooms add microwaves and daybeds. Room service is 24/7. There's a wood-paneled restaurant, a chic bar/lounge and a cafe, as well as an outdoor pool, hot tubs and a sauna/steam room. There's also a kids' club. Parking and breakfast are available.",
        "Lat": "-7.776544282",
        "Long": "110.3823098",
        "Images": "https://origin.pegipegi.com/jalan/images/pict1L/Y4/Y932044/Y932044022.jpg"
    },
    "25": {
        "id": "25",
        "Name": "HOM Premiere Timoho",
        "Kota": "Yogyakarta",
        "Ratings": "4.5",
        "Price": "283433",
        "Addres": "Jl. Ipda Tut Harsono No.24, Muja Muju, Kec. Umbulharjo, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55165",
        "Coordinate": "-7.798319563368921, 110.39274564907477",
        "Description": "Set in an area with restaurants, this informal hotel is 4 km from shops along Jalan Malioboro, 15 minutes on foot from the Gembira Loka Zoo and 7 km from Adisucipto International Airport. Unassuming rooms come with Wi-Fi and flat-screen TVs. Upgraded rooms add sitting areas. There's 24-hour room service. Amenities include a restaurant and an airy lobby lounge with floor-to-ceiling windows, as well as a courtyard pool. Parking and breakfast are available.",
        "Lat": "-7.798319563",
        "Long": "110.3927456",
        "Images": "https://pix10.agoda.net/hotelImages/17242425/-1/394e457565fcc3ea7e9545418aef214f.jpg?ca=26&ce=0&s=1024x768"
    },
    "26": {
        "id": "26",
        "Name": "3C Familia Residence",
        "Kota": "Yogyakarta",
        "Ratings": "4.2",
        "Price": "",
        "Addres": "Jalan Mayjend Bambang Sugeng No.949, Bausasran, Kec. Danurejan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55211",
        "Coordinate": "-7.796221262222834, 110.37532116256742",
        "Description": "",
        "Lat": "-7.796221262",
        "Long": "110.3753212",
        "Images": "https://ik.imagekit.io/tvlk/apr-asset/dgXfoyh24ryQLRcGq00cIdKHRmotrWLNlvG-TxlcLxGkiDwaUSggleJNPRgIHCX6/hotel/asset/10010954-900x486-FIT_AND_TRIM-28df2ea6ce82eb4b303d102878010e06.jpeg?_src=imagekit&tr=c-at_max,h-488,q-40,w-768"
    },
    "27": {
        "id": "27",
        "Name": "Abrisam Shareeah Family Homestay",
        "Kota": "Yogyakarta",
        "Ratings": "4.1",
        "Price": "949999",
        "Addres": "59F8+RV3, jln cepakasari, Brontokusuman, Mergangsan, Yogyakarta City, Special Region of Yogyakarta 55143",
        "Coordinate": "-7.825356067374318, 110.36717249325366",
        "Description": "",
        "Lat": "-7.825356067",
        "Long": "110.3671725",
        "Images": "http://pix1.agoda.net/hotelimages/agoda-homes/6173570/818366728005c213618afe3e8a9cc733.jpg"
    },
    "28": {
        "id": "28",
        "Name": "Adhisthana Hotel",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "323513",
        "Addres": "Jl. Prawirotaman 2 No.613, Brontokusuman, Kec. Mergangsan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55153",
        "Coordinate": "-7.819640755329321, 110.37218216441788",
        "Description": "Featuring an eclectic facade made from upcycled shutters and windows, this hip hotel is 2 km from the De Mata Trick Eye Museum and 4 km from Gembira Loka Zoo. Featuring rustic country-style decor, the bright single-sex dorms offer Wi-Fi, reading lamps and en suite bathrooms. Private rooms have flat-screens, and tea and coffeemakers; suites add minibars and sofas. Amenities include a simple guest lounge, and a trendy cafe/bar with a terrace, as well as an internal courtyard with an outdoor pool and lounge chairs. Breakfast is available.",
        "Lat": "-7.819640755",
        "Long": "110.3721822",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/65649671.jpg?k=cf0a721489a382dd8932e304f56a4d9803cd28dc0d3488421d9bebe64c01a446&o=&hp=1"
    },
    "29": {
        "id": "29",
        "Name": "Aloha Hotel",
        "Kota": "Yogyakarta",
        "Ratings": "4.8",
        "Price": "228015",
        "Addres": "MG III/573B, Jl. Prawirotaman, Brontokusuman, Kec. Mergangsan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55153",
        "Coordinate": "-7.818449912529353, 110.37217874907478",
        "Description": "",
        "Lat": "-7.818449913",
        "Long": "110.3721787",
        "Images": "https://media-cdn.tripadvisor.com/media/photo-s/0d/72/25/21/aloha-hotel.jpg"
    },
    "30": {
        "id": "30",
        "Name": "Arjuna 31 Homestay",
        "Kota": "Yogyakarta",
        "Ratings": "4.5",
        "Price": "99778",
        "Addres": "Jl. Arjuna No.31, Wirobrajan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55252",
        "Coordinate": "-7.804386355046464, 110.34806874907478",
        "Description": "On a leafy residential street, this cozy homestay is 3 km from trains at Stasiun Jogjakarta and 4 km from the lively shopping area of Jalan Malioboro. The straightforward mixed-gender dorms provide bunk beds and lockers. Private rooms are also available. All quarters offer shared bathrooms and complimentary Wi-Fi. Coffee and tea are included. Motorbike rentals are available.",
        "Lat": "-7.804386355",
        "Long": "110.3480687",
        "Images": "https://origin.pegipegi.com/jalan/images/pict1L/Y6/Y955786/Y955786041.jpg"
    },
    "31": {
        "id": "31",
        "Name": "Ayola Tasneem Convention Hotel",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "246225",
        "Addres": "Jl. Brigjend. Katamso-IredaKeparakan, Mergangsan, Yogyakarta, Indonesia, 55152",
        "Coordinate": "-7.808151798101397, 110.37113753558211",
        "Description": "",
        "Lat": "-7.808151798",
        "Long": "110.3711375",
        "Images": "https://media-cdn.tripadvisor.com/media/photo-s/0c/93/34/fc/tasneem-convention-hotel.jpg"
    },
    "32": {
        "id": "32",
        "Name": "Best City Hotel",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "224456",
        "Addres": "Jl. Tentara Pelajar No.44, Bumijo, Kec. Jetis, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55231",
        "Coordinate": "-7.783270155067768, 110.36094993558211",
        "Description": "",
        "Lat": "-7.783270155",
        "Long": "110.3609499",
        "Images": "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/10/31/4fd27523-ad32-46d1-893c-824d882d31cf-1604138753588-dfae3615a9d586346b7f0f5663cb6136.jpg"
    },
    "33": {
        "id": "33",
        "Name": "Cavinton Hotel Yogyakarta by Tritama Hospitality",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "388189",
        "Addres": "Jl. Letjen Suprapto No.1, Ngampilan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55261",
        "Coordinate": "-7.800566746395892, 110.35605109325368",
        "Description": "This modern, upscale hotel is 1 km from the 18th-century Kraton of Yogyakarta palace complex and 2 km from Jalan Malioboro shopping district. Warm rooms and suites feature flat-screen TVs, free Wi-Fi and minifridges, plus tea and coffeemaking facilities. Some rooms have city views. Suites add separate living rooms, balconies and safes. Room service is available 24/7. Parking is complimentary. Indonesian and Western cuisine is served in an airy restaurant and in a top floor dining room with 360 degree views. There's also a relaxed coffee shop, a pool and a children's play area, plus a gym, a ballroom and a business center.",
        "Lat": "-7.800566746",
        "Long": "110.3560511",
        "Images": "https://ik.imagekit.io/tvlk/apr-asset/dgXfoyh24ryQLRcGq00cIdKHRmotrWLNlvG-TxlcLxGkiDwaUSggleJNPRgIHCX6/hotel/asset/10001367-1280x853-FIT_AND_TRIM-1f62f1408c1e7ae1904245ff0199d6c6.jpeg?tr=q-40,c-at_max,w-1280,h-720&_src=imagekit"
    },
    "34": {
        "id": "34",
        "Name": "De Laxston by Azana",
        "Kota": "Yogyakarta",
        "Ratings": "3.5",
        "Price": "294820",
        "Addres": "Jl. Urip Sumoharjo No.139 A, Klitren, Kec. Gondokusuman, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55222",
        "Coordinate": "-7.782786274902553, 110.38717169325365",
        "Description": "Set along a bustling commercial street, this casual hotel is 3 km from Yogyakarta train station, 4 km from Gembira Loka Zoo and 5 km from the 18th-century Palace of Yogyakarta. Relaxed rooms come with free Wi-Fi, flat-screen TVs and sitting areas, as well as tea and coffeemaking facilities. Suites add minifridges and separate living space. Room service is provided 24/7. Complimentary amenities include parking, and breakfast served in an airy restaurant. There’s also an indoor pool, a modest lobby lounge, and meeting and event space.",
        "Lat": "-7.782786275",
        "Long": "110.3871717",
        "Images": "https://visitingjogja.jogjaprov.go.id/web/wp-content/uploads/2020/02/laxston5.jpg"
    },
    "35": {
        "id": "35",
        "Name": "Gloria Amanda Hotel",
        "Kota": "Yogyakarta",
        "Ratings": "2.5",
        "Price": "245370",
        "Addres": "Jl. Sosrowijayan Jl. Sosrowijayan GT I No.195, Sosromenduran, Gedong Tengen, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55271",
        "Coordinate": "-7.790764320854552, 110.36337357791052",
        "Description": "A 6-minute walk from the bustling shops and restaurants of Jalan Malioboro, this straightforward hotel is a 5-minute walk from the Yogyakarta train station and 10-minute walk from the Pasar Pathuk farmer's market. Basic rooms offer free Wi-Fi, cold-water bathrooms, fans and TVs. Upgraded rooms add flat-screen TVs, hot water bathrooms and air-conditioning. Some upgraded rooms also have extra beds, minibars, and tea and coffeemaking facilities. Complimentary amenities include parking and breakfast. There's also an outdoor pool. Massage services are available.",
        "Lat": "-7.790764321",
        "Long": "110.3633736",
        "Images": "https://ak-d.tripcdn.com/images/200l0e0000006zmuk777C_R_800_525.jpg"
    },
    "36": {
        "id": "36",
        "Name": "Grand Senyum Hotel",
        "Kota": "Yogyakarta",
        "Ratings": "4.5",
        "Price": "513216",
        "Addres": "Jl. Pangeran Diponegoro No.27, Gowongan, Kec. Jetis, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55232",
        "Coordinate": "-7.783114145120513, 110.36535710674632",
        "Description": "In a bustling shopping and dining area, this polished hotel is a 14-minute walk from Yogyakarta train station, and 4 km from both Sari Garden and the Fort Vredeburg Museum. Elegant rooms provide TVs, and tea and coffeemaking facilities. Upgraded rooms add sitting areas; suites have separate living rooms. Amenities include a rooftop terrace with a pool, plus a restaurant, and an airy lobby lounge with floor-to-ceiling windows. Bike rentals, event space and Wi-Fi are also offered. Breakfast is available, with a floating in-pool option.",
        "Lat": "-7.783114145",
        "Long": "110.3653571",
        "Images": "https://origin.pegipegi.com/jalan/images/pict1L/Y6/Y959086/Y959086082.jpg"
    },
    "37": {
        "id": "37",
        "Name": "Hasian Malioboro Motel",
        "Kota": "Yogyakarta",
        "Ratings": "3.0",
        "Price": "227713",
        "Addres": "Jl. Perwakilan No.26, Suryatmajan, Kec. Danurejan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55213",
        "Coordinate": "-7.7924819792078015, 110.3671308644179",
        "Description": "",
        "Lat": "-7.792481979",
        "Long": "110.3671309",
        "Images": "https://origin.pegipegi.com/jalan/images/pict1L/Y6/Y946496/Y946496033.jpg"
    },
    "38": {
        "id": "38",
        "Name": "Hotel GRAND ROSELA Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "3.0",
        "Price": "315714",
        "Addres": "Jl. Prawirotaman No.28, Brontokusuman, Kec. Mergangsan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55153",
        "Coordinate": "-7.819214691105671, 110.37126672208944",
        "Description": "On a bustling street lined with eateries, this modest hotel is 5 km from Jogjakarta train station. It's 3 km from both Fort Vredeburg Museum and Traditional Market Bringharjo. Bright, relaxed rooms offer TVs, air-conditioning and minifridges. All feature tea and coffeemaking facilities, as well as hot and cold water. Some have seating areas. A buffet-style restaurant features international cuisine and offers both al fresco and outdoor patio dining. Other amenities include an outdoor pool, a garden and event space.",
        "Lat": "-7.819214691",
        "Long": "110.3712667",
        "Images": "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/11/13/0d5b41d5-e430-48b0-9229-81fa7f188928-1605275562917-537b8e6cf55e35f8fda688a8ce99d82c.jpg"
    },
    "39": {
        "id": "39",
        "Name": "Madani Syariah Hotel",
        "Kota": "Yogyakarta",
        "Ratings": "1.5",
        "Price": "",
        "Addres": "Jl. Cantel Baru II No.1 A, Muja Muju, Kec. Umbulharjo, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55165",
        "Coordinate": "-7.7951795835331685, 110.38772722208942",
        "Description": "",
        "Lat": "-7.795179584",
        "Long": "110.3877272",
        "Images": "https://pix10.agoda.net/hotelImages/862/862830/862830_15070910120031929632.jpg?ca=4&ce=1&s=1024x768"
    },
    "40": {
        "id": "40",
        "Name": "Hotel Mataram Malioboro",
        "Kota": "Yogyakarta",
        "Ratings": "3.5",
        "Price": "412072",
        "Addres": "Jl. Ps. Kembang No.61, Sosromenduran, Gedong Tengen, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55271",
        "Coordinate": "-7.78984450962976, 110.36267534907475",
        "Description": "",
        "Lat": "-7.78984451",
        "Long": "110.3626753",
        "Images": "https://origin.pegipegi.com/jalan/images/pict1L/Y4/Y958004/Y958004027.jpg"
    },
    "41": {
        "id": "41",
        "Name": "Sans Hotel Heryon Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "4.5",
        "Price": "220961",
        "Addres": "Jl. Menteri Supeno No.28D, Sorosutan, Kec. Umbulharjo, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55162",
        "Coordinate": "-7.816228644011223, 110.37777645092524",
        "Description": "",
        "Lat": "-7.816228644",
        "Long": "110.3777765",
        "Images": "https://q-xx.bstatic.com/xdata/images/hotel/840x460/323173141.jpg?k=13e8b67910ca992c1907a61b342d54c63d786b838df705a36f5b3651fa3f5c4e&o="
    },
    "42": {
        "id": "42",
        "Name": "Hotel Museum Batik",
        "Kota": "Yogyakarta",
        "Ratings": "4.2",
        "Price": "263247",
        "Addres": "Jl. Doktor Sutomo No.13A, Bausasran, Kec. Danurejan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55211",
        "Coordinate": "-7.795340802375508, 110.37727003558211",
        "Description": "",
        "Lat": "-7.795340802",
        "Long": "110.37727",
        "Images": "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/10/29/adaa3f0c-02f6-47fc-98d7-a42af3a71007-1603907885324-c54e0084cb222e6846392964038cca43.jpg"
    },
    "43": {
        "id": "43",
        "Name": "Hotel Neo Malioboro by ASTON",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "555902",
        "Addres": "Jl. Ps. Kembang No.21, Sosromenduran, Gedong Tengen, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55271",
        "Coordinate": "-7.789809628898857, 110.36459743558213",
        "Description": "A 2-minute walk from both Yogyakarta train station and the shops and stalls of vibrant Jalan Malioboro street, this modern hotel is 2 km from the Keraton Ngayogyakarta Hadiningrat royal palace. Bright, relaxed rooms feature free Wi-Fi, flat-screen TVs and minibars, as well as tea and coffeemaking facilities. Upgraded rooms add living areas with sofabeds. Room service is offered. There’s an informal restaurant; breakfast is extra. Other amenities include a rooftop bar and lounge, a spa, an outdoor pool and a kids’ pool. Parking is available.",
        "Lat": "-7.789809629",
        "Long": "110.3645974",
        "Images": "https://ak-d.tripcdn.com/images/22080u000000jb1nb5539_R_800_525.jpg"
    },
    "44": {
        "id": "44",
        "Name": "Hotel Indah Palace Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "3.5",
        "Price": "327826",
        "Addres": "Jl. Sisingamangaraja No.74, Brontokusuman, Kec. Mergangsan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55153",
        "Coordinate": "-7.818314503404872, 110.37291342208945",
        "Description": "This tranquil hotel is set on a tree-lined street, dotted with greenery. It's 4 km from shopping on buzzy Jalan Malioboro, a 6-minute walk from a bus stop and 3 km from Taman Sari, the former royal gardens. The straightforward rooms come with free Wi-Fi, flat-screen TVs, air-conditioning and minifridges, plus tea and coffeemaking facilities. All have garden views, while upgraded rooms add sitting areas.There's a warm restaurant, as well as an outdoor pool with a deck, and sitting areas dotted with greenery. Event space is also available.",
        "Lat": "-7.818314503",
        "Long": "110.3729134",
        "Images": "https://q-xx.bstatic.com/xdata/images/hotel/840x460/151501246.jpg?k=2bcc9c99692ca0aa6144e886e451fcad65a76cbdd1ce732f0dfead1a7cf2c489&o="
    },
    "45": {
        "id": "45",
        "Name": "Hotel New Saphir Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "3.5",
        "Price": "414309",
        "Addres": "Jl. Laksda Adisucipto No.38, Demangan, Kec. Gondokusuman, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55221",
        "Coordinate": "-7.7834327551151885, 110.39145309325367",
        "Description": "This chic, palm-tree fronted hotel with views of Mount Merapi is 2 km from Lempuyangan train station and 4 km from the shopping of Jalan Malioboro. The upscale rooms and suites feature free Wi-Fi, flat-screens, and tea and coffeemakers. Some have sofas and/or mountain or pool views, and suites add extra bathrooms and living rooms with TVs; some have dining areas. An upgraded suite has a dining room and a pantry, as well as a complimentary butler service. Room service is offered 24/7. There's free continental breakfast and parking. Other amenities include a restaurant, a gym and an outdoor pool, as well as a bar, a tennis court and a ballroom.",
        "Lat": "-7.783432755",
        "Long": "110.3914531",
        "Images": "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/10/31/785293e5-2c4d-4a25-8b34-5b4f8d3d4d1a-1604161009913-6410882aa83e38dbcbb075949da221c0.jpg"
    },
    "46": {
        "id": "46",
        "Name": "Novatel Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "191606",
        "Addres": "Jl. KH Wahid Hasyim No.61, Notoprajan, Ngampilan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55262",
        "Coordinate": "-7.804953608116588, 110.35628709140322",
        "Description": "Set among shops and restaurants, this understated hotel is 3 km from the Jogjakarta station, 1 km from the Taman Sari garden and 2 km from Fort Vredeburg Museum. The bright, relaxed rooms include free Wi-Fi and flat-screen TVs. Upgraded rooms add tea and coffeemakers, and balconies with garden or pool views. Suites add living rooms with sofabeds. A breakfast buffet and parking are complimentary. Other amenities include a lobby bar and casual restaurant serving international cuisine, plus an outdoor pool, a fitness center and a sauna. Event space is available.",
        "Lat": "-7.804953608",
        "Long": "110.3562871",
        "Images": "https://exp.cdn-hotels.com/hotels/16000000/15070000/15066300/15066225/19f233c7_z.jpg?impolicy=fcrop&w=500&h=333&q=medium"
    },
    "47": {
        "id": "47",
        "Name": "Hotel Ogh Doni",
        "Kota": "Yogyakarta",
        "Ratings": "1.5",
        "Price": "141127",
        "Addres": "Jl. Tri Brata No.1A, Klitren, Kec. Gondokusuman, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55222",
        "Coordinate": "-7.78353945530252, 110.38723472023901",
        "Description": "",
        "Lat": "-7.783539455",
        "Long": "110.3872347",
        "Images": "https://pix10.agoda.net/hotelImages/400/400958/400958_121128162359613.png?ca=0&ce=1&s=1024x768"
    },
    "48": {
        "id": "48",
        "Name": "Hotel Pules",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "238232",
        "Addres": "Jl. Mataram No.88, Suryatmajan, Kec. Danurejan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55213",
        "Coordinate": "-7.791586861917696, 110.36770209325368",
        "Description": "",
        "Lat": "-7.791586862",
        "Long": "110.3677021",
        "Images": "https://pbs.twimg.com/media/BQ0rIwjCAAMecur.jpg"
    },
    "49": {
        "id": "49",
        "Name": "Hotel Puspita",
        "Kota": "Yogyakarta",
        "Ratings": "3.5",
        "Price": "114000",
        "Addres": "Jl. Mayjend Sutoyo No.64, Mantrijeron, Kec. Mantrijeron, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55143",
        "Coordinate": "-7.814540226266032, 110.36662127791053",
        "Description": "On a bustling street, this low-key hotel is 2 km from Keraton Ngayogyakarta Hadiningrat, an 18th-century palace, and 4 km from shopping along lively Jalan Malioboro. Accessible by exterior corridors, the no-nonsense rooms have fans and outdoor seating. Upgraded rooms come with TVs and/or air-conditioning. Complimentary amenities include parking, as well as breakfast and tea served in a bright, relaxed breakfast room. There's also a courtyard with a furnished garden.",
        "Lat": "-7.814540226",
        "Long": "110.3666213",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1280x900/192450683.jpg?k=9c6ec2bb530e6ee87b376baae1102eb1f9a119509019248ca3486c2c2301155f&o=&hp=1"
    },
    "50": {
        "id": "50",
        "Name": "Hotel Pyrenees",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "307609",
        "Addres": "Jl. Sosrowijayan No.1, Sosromenduran, Gedong Tengen, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55271",
        "Coordinate": "-7.79161208104202, 110.36558416441788",
        "Description": "This informal hotel set in a striking contemporary building is a 2-minute walk from Jalan Malioboro, a popular shopping street, 5 minutes' walk from Stasiun Yogyakarta and 3 km from Taman Sari, a former royal garden. Offering modern decor, the bright rooms come with free Wi-Fi and flat-screen TVs. Upgraded rooms add tea and coffeemakers, and suites feature sitting areas. A breakfast buffet is complimentary. There's a casual cafe/restaurant offering regional and European cuisine, as well as a rooftop lounge. Pets are welcome.",
        "Lat": "-7.791612081",
        "Long": "110.3655842",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1280x900/83992616.jpg?k=779bc558f700621eea9ef426a2032597bc705d9505fac33d3a713621efb9a62f&o=&hp=1"
    },
    "51": {
        "id": "51",
        "Name": "Hotel Santika Premiere Jogja",
        "Kota": "Yogyakarta",
        "Ratings": "4.5",
        "Price": "518837",
        "Addres": "Jl. Jend. Sudirman No.19, Cokrodiningratan, Kec. Jetis, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55233",
        "Coordinate": "-7.782247404680448, 110.36977385092524",
        "Description": "Among city-center businesses, this upscale hotel is 2 km from the Jalan Malioboro shopping district and 8 km from Adisucipto International Airport. Elegant rooms feature free Wi-Fi and flat-screen TVs, plus minibars, safes, and tea and coffeemakers. Upgraded rooms have balconies. Suites add kitchenettes and living areas. There's 24/7 room service. Kids age 12 and under stay at no charge with an adult. Breakfast and parking are complimentary. Other amenities include 2 restaurants and a coffee shop, plus a business center and a fitness center. There's also a spa, a hot tub and an outdoor pool, as well as an airport shuttle.",
        "Lat": "-7.782247405",
        "Long": "110.3697739",
        "Images": "https://exp.cdn-hotels.com/hotels/1000000/530000/523700/523641/7820558b_z.jpg?impolicy=fcrop&w=773&h=530&q=high"
    },
    "52": {
        "id": "52",
        "Name": "Hotel Surya Putri by RedDoorz",
        "Kota": "Yogyakarta",
        "Ratings": "3.5",
        "Price": "",
        "Addres": "Jl. Tukangan No.29, Tegal Panggung, Kec. Danurejan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55212",
        "Coordinate": "-7.791973498064445, 110.3718665644179",
        "Description": "",
        "Lat": "-7.791973498",
        "Long": "110.3718666",
        "Images": "https://media-cdn.tripadvisor.com/media/photo-m/1280/17/14/0b/74/profile-hotel-surya-putri.jpg"
    },
    "53": {
        "id": "53",
        "Name": "Hotel Tentrem",
        "Kota": "Yogyakarta",
        "Ratings": "4.7",
        "Price": "1446717",
        "Addres": "Jl. P. Mangkubumi No.72A, Cokrodiningratan, Kec. Jetis, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55233",
        "Coordinate": "-7.773544228912884, 110.36841849140322",
        "Description": "Among shops and restaurants, this lavish hotel is 2.9 km from the markets on buzzy Jalan Malioboro, and 5 km from Keraton Ngayogyakarta Hadiningrat palace. Plush, modern rooms offer free Wi-Fi and flat-screen TVs, plus minibars, and tea and coffeemakers. Upgraded rooms have balconies; studios and 1- to 2-bedroom suites add living areas and/or whirlpool tubs. An upgraded suite offers a kitchenette, a powder room and 24/7 butler service. A breakfast buffet and parking are complimentary. Other amenities include 2 upscale restaurants and a polished lounge, plus an outdoor pool with a poolside bar. There’s also a spa, a gym and a boutique.",
        "Lat": "-7.773544229",
        "Long": "110.3684185",
        "Images": "https://d2ile4x3f22snf.cloudfront.net/wp-content/uploads/sites/210/2017/11/26090747/2200-1200-Pool-21.jpg"
    },
    "54": {
        "id": "54",
        "Name": "Unisi Yogyakarta Syariah",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "323086",
        "Addres": "Jl. Ps. Kembang No.42, Sosromenduran, Gedong Tengen, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55271",
        "Coordinate": "-7.789913899137515, 110.36382106441789",
        "Description": "On a bustling street in the city center, this casual budget hotel is an 8-minute walk from both Jogjakarta train station and Jalan Malioboro, a major shopping street. Featuring photographic wall murals, the cozy rooms come with free Wi-Fi, flat-screen TVs, and tea and coffeemaking facilities. Room service is available 24/7. There's a relaxed restaurant.",
        "Lat": "-7.789913899",
        "Long": "110.3638211",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1280x900/228968096.jpg?k=22b3478251f38d394e5a8a8894fa256f9b4670ac32477fc9bfa9a082368607a9&o=&hp=1"
    },
    "55": {
        "id": "55",
        "Name": "Hotel Winotosastro Garden",
        "Kota": "Yogyakarta",
        "Ratings": "3.0",
        "Price": "270000",
        "Addres": "Jl. Sartono, Mantrijeron, Kec. Mantrijeron, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55143",
        "Coordinate": "-7.819625916892901, 110.36720525092522",
        "Description": "Set in a colorful building on a downtown street, this laid-back hotel is a 13-minute walk from a transit stop, 2 km from the 18th-century gardens at Taman Sari, and 4 km from shopping and dining at Jalan Malioboro. Unfussy rooms come with free Wi-Fi, plus TVs, and balconies or terraces. Family rooms are available. Free perks include a breakfast buffet and parking. Other amenities include a courtyard garden with seating areas, in addition to a laundry, and a cafe with a terrace. Reception is available 24/7.",
        "Lat": "-7.819625917",
        "Long": "110.3672053",
        "Images": "https://d39wptbp5at4nd.cloudfront.net/media/61335_original_(Lowongan_Kerja)_Dicari_KaryawanKaryawati_Untuk_Housekeeping_dan_Tukang_Masak_di_Hotel_Winotosastro_Garden_Yogyakarta_(Walk_in_Interview__Wawancara_Langsung).JPG"
    },
    "56": {
        "id": "56",
        "Name": "Indies Heritage Hotel Prawirotaman Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "361538",
        "Addres": "Jl. Prawirotaman 3 Timuran No.3, Brontokusuman, Kec. Mergangsan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55153",
        "Coordinate": "-7.820338630179709, 110.36953179325367",
        "Description": "Set in a stately building, this elegant, Colonial-style hotel is 3 km from Keraton Ngayogyakarta Hadiningrat, an 18th-century palace, and 12 km from Adisutjipto International Airport. The polished rooms come with Wi-Fi, flat-screen TVs and safes, plus tea and coffeemaking facilities. Upgraded rooms provide furnished balconies. Suites have minibars, and living areas with sofabeds. Room service is available. Breakfast is available. There's a restaurant and an outdoor pool.",
        "Lat": "-7.82033863",
        "Long": "110.3695318",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/62392585.jpg?k=78f2b4a65ad5094d4e100a06e1be81a39ab2bb9fd5348bc0fd803632158753c4&o=&hp=1"
    },
    "57": {
        "id": "57",
        "Name": "Jambuluwuk Malioboro Hotel Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "3.8",
        "Price": "499380",
        "Addres": "Jl. Gajah Mada No.67, Purwokinanti, Pakualaman, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55166",
        "Coordinate": "-7.797358681375238, 110.37256902393989",
        "Description": "Set in the downtown area, this modern hotel is a 14-minute walk from the Jalan Malioboro shopping district and the Fort Vredeburg Museum, and 9 km from Adisucipto International Airport. The sophisticated rooms provide minibars, free Wi-Fi and satellite TV, plus tea and coffeemakers. Upgraded rooms and suites add city views, dining areas and/or separate living rooms. Room service is available 24/7. Airport transfers are free. There's a full-service spa, a gym, and a pool surrounded by tropical greenery. Other amenities include a coffee shop, an open-air bistro and a lounge with live music, along with a karaoke lounge.",
        "Lat": "-7.797358681",
        "Long": "110.372569",
        "Images": "https://ik.imagekit.io/tvlk/apr-asset/dgXfoyh24ryQLRcGq00cIdKHRmotrWLNlvG-TxlcLxGkiDwaUSggleJNPRgIHCX6/hotel/asset/10003449-1200x1006-FIT_AND_TRIM-da98526eb383abd8c3dc21f3d4caffc0.jpeg?tr=q-40,c-at_max,w-1280,h-720&_src=imagekit"
    },
    "58": {
        "id": "58",
        "Name": "Kalya Hotel Yogyakarta",
        "Kota": "Yogyakarta",
        "Ratings": "4.0",
        "Price": "229376",
        "Addres": "Jl. Gedongkuning No.118, Rejowinangun, Kec. Kotagede, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55171",
        "Coordinate": "-7.813321930025307, 110.40139140674631",
        "Description": "A 13-minute walk from the Kotagede historic district, this modern budget hotel is 7 km from the Taman Sari former royal gardens, and 6 km from the colonial-era Fort Vredeburg Museum. Slick rooms with colorful decor feature flat-screen TVs and free Wi-Fi, as well as work desks. There's a contemporary lounge area, and an outdoor pool with a sundeck. Breakfast and parking are offered for a surcharge.",
        "Lat": "-7.81332193",
        "Long": "110.4013914",
        "Images": "https://pix10.agoda.net/hotelImages/1094103/-1/c68b58868cb7337ef9025637c035e7de.jpg?ca=7&ce=1&s=1024x768"
    },
    "59": {
        "id": "59",
        "Name": "Kampoeng Djawa Guesthouse",
        "Kota": "Yogyakarta",
        "Ratings": "3.5",
        "Price": "166250",
        "Addres": "Jl. Prawirotaman No.1 No.40, Brontokusuman, Kec. Mergangsan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55153",
        "Coordinate": "-7.819169742163702, 110.37257920674631",
        "Description": "",
        "Lat": "-7.819169742",
        "Long": "110.3725792",
        "Images": "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2021/05/28/617ac79c-2132-49d3-aa2b-12c76b35bdb7-1622166312040-e7f3a0cc0780a07c1dea2929f99bc3fb.jpg"
    },
    "60": {
        "id": "60",
        "Name": "Ki Agung Prestise Hotel",
        "Kota": "Yogyakarta",
        "Ratings": "3.0",
        "Price": "117810",
        "Addres": "Jl. Gerilya No.596A, Brontokusuman, Kec. Mergangsan, Kota Yogyakarta, Daerah Istimewa Yogyakarta 55153",
        "Coordinate": "-7.819776585489472, 110.36923099528273",
        "Description": "",
        "Lat": "-7.819776585",
        "Long": "110.369231",
        "Images": "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/10/28/124fe366-36f9-4eda-a906-e621011af2c7-1603900169487-fae0080070a8a9c61a649cd035cd12f2.jpg"
    },
    "61": {
        "id": "61",
        "Name": "The Alea Hotel Seminyak",
        "Kota": "Bali",
        "Ratings": "4.2",
        "Price": "4,403,576.00",
        "Addres": "Jl. Cendrawasih No.78, Seminyak, Kec. Kuta Utara, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.67463167686094, 115.15341976860144",
        "Description": "Set on a narrow, winding street, this upmarket hotel with an industrial-chic facade is 3 km from Seminyak Beach and 5 km from 3D experiences at Dream Museum Zone Bali (DMZ). Streamlined rooms with neutral hues feature free Wi-Fi, flat-screen TVs and minibars, as well as tea and coffeemakers. Upgraded quarters overlook or offer direct access to a pool. There's a sleek cocktail bar with marble floors, as well as outdoor pools and a spa. Breakfast is extra.",
        "Lat": "-8.674631677",
        "Long": "115.1534198",
        "Images": "https://pix10.agoda.net/hotelImages/569/569051/569051_15021910020025447086.jpg?ca=3&ce=1&s=1024x768"
    },
    "62": {
        "id": "62",
        "Name": "Atanaya Kuta Bali",
        "Kota": "Bali",
        "Ratings": "4.4",
        "Price": "275,705.00",
        "Addres": "Jl. Sunset Road No.88A, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.70357015159306, 115.18059606116576",
        "Description": "This modern, casual hotel is an 8-minute walk from the unique exhibits at 3D Dream Museum Zone Bali, as well as 3 km from both the shops and restaurants of Seminyak and the beach. The warm-toned rooms and suites feature carved wood artwork, and offer free Wi-Fi, flat-screen TVs, minibars, and tea and coffeemaking facilities. Upgraded suites add living areas and mountain views. Amenities include a relaxed Chinese/Indonesian restaurant, an open-air cafe, and a laid-back bar next to the rooftop infinity pool and sun loungers. There's free parking.",
        "Lat": "-8.703570152",
        "Long": "115.1805961",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/267601572.jpg?k=9123f91c539819271cef4a0ebe94f2826425af7d9d8fc107382153faffcddf8e&o=&hp=1"
    },
    "63": {
        "id": "63",
        "Name": "Grand Livio Kuta Hotel",
        "Kota": "Bali",
        "Ratings": "4.4",
        "Price": "176,762.00",
        "Addres": "Jl. Dewi Sri No.17, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.707926067445976, 115.1789058788881",
        "Description": "A 6 km drive from Bali Ngurah Rai International Airport, this trendy hotel is 1 km from buzzy Jalan Legian and 2 km from Legian Beach. Funky, colorful rooms offer minibars, flat-screen TVs and free Wi-Fi, as well as desks, safes, and tea and coffeemaking facilities. Upgraded rooms add living areas. Room service is available 24/7. Complimentary amenities include parking, and an international breakfast buffet. There's also a striking restaurant, and a bar with a streetfront terrace, plus an outdoor pool, and clubs for children age 12 and under.",
        "Lat": "-8.707926067",
        "Long": "115.1789059",
        "Images": "https://pix10.agoda.net/hotelImages/161/1612647/1612647_16101216460047680684.jpg?ca=6&ce=1&s=1024x768"
    },
    "64": {
        "id": "64",
        "Name": "Mega Boutique Hotel & Spa",
        "Kota": "Bali",
        "Ratings": "4.3",
        "Price": "305,266.00",
        "Addres": "SImpang Siur, Jl. Bypass Ngurah Rai No.259, Kuta, Denpasar Selatan, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.721310373139259, 115.18644739196829",
        "Description": "Among shops and eateries on a bustling commercial street, this modern hotel is 4 km from lively Kuta Beach and 6 km from Ngurah Rai International Airport. Warmly furnished rooms feature Wi-Fi, flat-screen TVs and minifridges, as well as en suite bathrooms with free-standing tubs and additional flat-screens; some add furnished balconies. Room service is available 24/7. Breakfast is offered. There's also a relaxed restaurant, a gym and a spa, plus a rooftop terrace with an outdoor pool and a bar. Parking is available.",
        "Lat": "-8.721310373",
        "Long": "115.1864474",
        "Images": "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/10/28/a9687edd-e394-43d9-a43d-ffd2e10bd5f1-1603889379011-d989a7fb278f05c3631e17177d2bf383.jpg"
    },
    "65": {
        "id": "65",
        "Name": "The ONE Legian",
        "Kota": "Bali",
        "Ratings": "4.3",
        "Price": "283,500.00",
        "Addres": "Jl. Raya Legian No.117, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.714040123752303, 115.17360076101478",
        "Description": "In a tree-lined area near shops and restaurants, this modern hotel is a 10-minute walk from Kuta Beach and 5 km from Ngurah Rai International Airport. Bright rooms feature flat-screens, free Wi-Fi and minifridges, plus tea and coffeemakers. Suites and family rooms add separate living areas. Some quarters have balconies and/or direct access to an outdoor pool. Room service is available. A free shuttle to Kuta Beach is available. A sleek rooftop terrace offers a pool, a bar and an eatery. There's also a casual restaurant with a street facing deck. Other amenities include a gym and a spa, as well as an additional outdoor pool on ground level.",
        "Lat": "-8.714040124",
        "Long": "115.1736008",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/08/80/a7/20/sky-pool--v8045648.jpg?w=900&h=-1&s=1"
    },
    "66": {
        "id": "66",
        "Name": "Quest San Hotel Denpasar by ASTON",
        "Kota": "Bali",
        "Ratings": "4.4",
        "Price": "243,832.00",
        "Addres": "Jl. Mahendradatta No.93, Padangsambian, Kec. Denpasar Bar., Kota Denpasar, Bali 80117",
        "Coordinate": "-8.677243218009908, 115.19045399667871",
        "Description": "Set in a polished roadside building surrounded by palm trees, this modern hotel is 6 km from the Petitenget Temple, 7 km from Seminyak Beach, and 17 km from the silver and gold shops of Celuk Village. Warmly decorated rooms feature balconies, Wi-Fi and flat-screen TVs, as well as minibars, and tea and coffeemakers. Suites add DVD players and iPod docks, plus living areas and kitchenettes. Room service is available 24/7. Breakfast and parking are complimentary. There's also an airy restaurant, along with a gym and an outdoor pool.",
        "Lat": "-8.677243218",
        "Long": "115.190454",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1280x900/45171835.jpg?k=104b3c7b1b7249bb3c409f7806406e786065fcec4f7e12ccb898b34fb4c34b2d&o=&hp=1"
    },
    "67": {
        "id": "67",
        "Name": "Hadi Poetra Hotel",
        "Kota": "Bali",
        "Ratings": "4.2",
        "Price": "187,789.00",
        "Addres": "Jl. Raya Kuta No.323-378, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.72822868187097, 115.17682182773531",
        "Description": "In a brick building off a bustling road, this laid-back hotel is within walking distance of restaurants. It's also a 15-minute stroll from Segara Beach along Bali Sea, 1 km from the pools and slides at Waterbom Bali, and 4 km from Ngurah Rai International Airport. Relaxed rooms with partial wood-paneled walls feature flat-screens, free Wi-Fi and balconies. Upgraded rooms add terraces with direct pool access. Breakfast is served in a casual dining room. Other amenities include a bar, a rooftop terrace, and warm lounges that have rustic carved wood furnishings and antiques. There's also an outdoor pool. Airport shuttles are available.",
        "Lat": "-8.728228682",
        "Long": "115.1768218",
        "Images": "https://ik.imagekit.io/tvlk/apr-asset/dgXfoyh24ryQLRcGq00cIdKHRmotrWLNlvG-TxlcLxGkiDwaUSggleJNPRgIHCX6/hotel/asset/10004980-d656731a45f7d5556546d555485b11ab.jpeg?tr=q-40,c-at_max,w-1280,h-720&_src=imagekit"
    },
    "68": {
        "id": "68",
        "Name": "POP! Hotel Teuku Umar",
        "Kota": "Bali",
        "Ratings": "4.0",
        "Price": "187,501.00",
        "Addres": "Jl. Teuku Umar No.74, Dauh Puri Kauh, Kec. Denpasar Bar., Kota Denpasar, Bali 80113",
        "Coordinate": "-8.679809043801406, 115.20384807278518",
        "Description": "Set in the town center, this colorful, contemporary hotel is 4 km from the Bali Museum, 6 km from Seminyak Beach and 12 km from Ngurah Rai International Airport. Offering free Wi-Fi, the bright, modern rooms also come with flat-screen TVs and air-conditioning. The hotel provides free parking, as well as a breakfast buffet, which is served in a vibrant dining room.",
        "Lat": "-8.679809044",
        "Long": "115.2038481",
        "Images": "https://pix10.agoda.net/hotelImages/230/230470/230470_15080710530033839490.jpg?ca=5&ce=1&s=1024x768"
    },
    "69": {
        "id": "69",
        "Name": "Hotel Neo Denpasar by ASTON",
        "Kota": "Bali",
        "Ratings": "4.4",
        "Price": "235,203.00",
        "Addres": "Jl. Gatot Subroto Barat, Padangsambian Kaja, Kec. Denpasar Bar., Kota Denpasar, Bali 80117",
        "Coordinate": "-8.636521610430902, 115.19295921142802",
        "Description": "Set in a modern building, this stylish, contemporary hotel is 5 km from the Bali Museum, 9 km from the buzzing Seminyak area and 11 km from Legian Beach. The polished, minimalist rooms have flat-screen TVs, minibars and free Wi-Fi, as well as safes, and tea and coffeemakers. Upgraded rooms add complimentary breakfast and may have garden views, while suites include balconies and living rooms with sofas. There's a trendy, casual restaurant with a bar. Other amenities include an outdoor pool and a fitness center. Beauty treatments are available.",
        "Lat": "-8.63652161",
        "Long": "115.1929592",
        "Images": "https://denpasartourism.com/images/hotel-villa/5cb408c14f984.jpg"
    },
    "70": {
        "id": "70",
        "Name": "BEST WESTERN Kuta Villa",
        "Kota": "Bali",
        "Ratings": "4.2",
        "Price": "291,456.00",
        "Addres": "Jl. Nyangnyang Sari, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.733302826584517, 115.17654141595072",
        "Description": "Set 3 km from Ngurah Rai International Airport, this polished hotel is also 6 km from Seminyak beach. The modern rooms offer free WiFi, flat-screen TVs, minifridges and 24-hour room service. Many have garden views; some feature terraces with outdoor showers. Suites add private plunge pools. Breakfast and parking are complimentary. There's an international restaurant, 2 bars and a cafe, as well as an outdoor pool, a 24-hour business center and BBQ grills.",
        "Lat": "-8.733302827",
        "Long": "115.1765414",
        "Images": "https://www.oyster.com/wp-content/uploads/sites/35/2019/05/pool-v8994583-1440-1024x683.jpg"
    },
    "71": {
        "id": "71",
        "Name": "ASTON Denpasar Hotel & Convention Center",
        "Kota": "Bali",
        "Ratings": "4.3",
        "Price": "263,403.00",
        "Addres": "Jl. Gatot Subroto Barat No.283, Pemecutan Kaja, Kec. Denpasar Utara, Kota Denpasar, Bali 80111",
        "Coordinate": "-8.639328959951705, 115.20612697755939",
        "Description": "Featuring a stately entrance with a circular driveway, this upscale business hotel is 3.4 km from the Bali Museum and 12 km from vibrant Legian Beach. Low-key rooms with modern furnishings feature free Wi-Fi and flat-screen TVs, plus minifridges, safes, and tea and coffeemaking facilities. Suites add living rooms and soaking tubs. Room service is available. Freebies include breakfast and welcome drinks. There's a casual restaurant offering halal cuisine. Additional perks include a gym and a spa, plus 3 pools, 2 kids' pools, and a polished lobby with stone-carved murals. There's also a business center, a grand ballroom and a conference center.",
        "Lat": "-8.63932896",
        "Long": "115.206127",
        "Images": "https://www.denpasarkota.go.id/uploads/datang/datang_193108090838_SetiapJumatSore,AstonDenpasarHotelConventionCenterHadirkanNongkrongBareng.jpg"
    },
    "72": {
        "id": "72",
        "Name": "Instyle Kuta Hotel Bali​​",
        "Kota": "Bali",
        "Ratings": "4.4",
        "Price": "Nan",
        "Addres": "Jl. Dewi Sri I No.16, Legian, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.70192621229162, 115.17840364066421",
        "Description": "In an area with multiple eateries, this relaxed hotel with a modern vibe is 2 km from the lively Legian Beach and 8 km from Ngurah Rai International Airport. Bright, streamlined rooms have Wi-Fi, flat-screen TVs and balconies, plus tea and coffeemakers. Suites add sitting areas. Some quarters offer direct pool access. There's room service. Amenities include a sleek bistro, a coffee shop and an outdoor pool, as well as a rooftop terrace with bar service. Breakfast, parking and an airport shuttle are available.",
        "Lat": "-8.701926212",
        "Long": "115.1784036",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1280x900/175012715.jpg?k=93e51e0c435db4a00d3e3cfa1e6e5ecdfd570c64becf3dd212229b915e85c609&o=&hp=1"
    },
    "73": {
        "id": "73",
        "Name": "Kyriad Royal Seminyak Bali",
        "Kota": "Bali",
        "Ratings": "4.5",
        "Price": "Nan",
        "Addres": "Jl. Sunset Road Jl. Nakula Gg. Baik-Baik No.1, Seminyak, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.692522362149882, 115.17333374434601",
        "Description": "Nan",
        "Lat": "-8.692522362",
        "Long": "115.1733337",
        "Images": "https://origin.pegipegi.com/jalan/images/pict1L/Y4/Y938224/Y938224001.jpg"
    },
    "74": {
        "id": "74",
        "Name": "Duo Legian Hotel",
        "Kota": "Bali",
        "Ratings": "4.3",
        "Price": "329,254.00",
        "Addres": "Jl. Batu Pageh Gg. Melani, Legian, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.709335050716854, 115.17308241519616",
        "Description": "Set near shops and eateries, this casual hotel is a 3-minute walk from bustling Legian Street and 18 minutes on foot from Legian Beach. It's 8 km from Ngurah Rai International Airport. Simple rooms provide free Wi-Fi, satellite TV and air-conditioning. Amenities include complimentary parking, an informal restaurant and a terrace. There's 24-hour security. An airport shuttle is available by request for a surcharge.",
        "Lat": "-8.709335051",
        "Long": "115.1730824",
        "Images": "https://ak-d.tripcdn.com/images/200d0h0000008sz097D5F_R_550_412_R5_Q70_D.jpg"
    },
    "75": {
        "id": "75",
        "Name": "Urban Style Biz Premier (Formerly Berry Biz Hotel)",
        "Kota": "Bali",
        "Ratings": "4.1",
        "Price": "208,651.00",
        "Addres": "Jl. Sunset Road No.99, Seminyak, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.697923957487985, 115.17770106794954",
        "Description": "A 4-minute walk from the interactive galleries at the 3D Dream Museum Zone Bali (DMZ), this laid-back hotel sits 5 km from both Kuta Beach and Waterbom Bali water park. Colorful rooms offer Wi-Fi, as well as flat-screen TVs, minibars, and tea and coffeemakers. They also include desks with dry erase boards. Some rooms are female only. Suites add separate living areas. Room service is available. Amenities include a lobby lounge, a trendy 24-hour coffee shop and a business center. Meeting rooms and breakfast are available.",
        "Lat": "-8.697923957",
        "Long": "115.1777011",
        "Images": "https://pix10.agoda.net/hotelImages/22216885/-1/13f7763d3ebe2b76c836c58f82488c45.jpg?ca=17&ce=1&s=1024x768"
    },
    "76": {
        "id": "76",
        "Name": "Collection O 14 Sun Boutique Hotel",
        "Kota": "Bali",
        "Ratings": "3.2",
        "Price": "169,164.00",
        "Addres": "Jl. Sunset Road No.23, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.707547110350186, 115.18385294907577",
        "Description": "Nan",
        "Lat": "-8.70754711",
        "Long": "115.1838529",
        "Images": "https://ak-d.tripcdn.com/images/200n0o000000f540xE612_Z_550_412_R5_Q70_D.jpg"
    },
    "77": {
        "id": "77",
        "Name": "The Kanjeng Suite & Villas - Seminyak",
        "Kota": "Bali",
        "Ratings": "3.6",
        "Price": "747,000.00",
        "Addres": "Jl. Dewi Saraswati III No.39, Seminyak, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.685775351447798, 115.17540371779114",
        "Description": "Nan",
        "Lat": "-8.685775351",
        "Long": "115.1754037",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1280x900/318905368.jpg?k=9e9ac5447f6747a704abdb781e7f0fbfcaf037abbabc9549af7500ab2054abc9&o=&hp=1"
    },
    "78": {
        "id": "78",
        "Name": "Fame Hotel Sunset Road Kuta Bali",
        "Kota": "Bali",
        "Ratings": "4.4",
        "Price": "197,150.00",
        "Addres": "Jl. Sunset Road No.9, Legian, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.700705754284224, 115.17849903395621",
        "Description": "Set on a main road, this vibrant modern hotel is 3 km from Seminyak Beach and 7 km from Ngurah Rai International Airport. Featuring colorful artwork of celebrities, the down-to-earth rooms have free Wi-Fi and flat-screen TVs. Some add private balconies. Breakfast is complimentary. Amenities include a relaxed restaurant, and an interior courtyard with an outdoor pool. There's also a kids' play area.",
        "Lat": "-8.700705754",
        "Long": "115.178499",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/ef/31/fa/fame-hotel-sunset-road.jpg?w=900&h=-1&s=1"
    },
    "79": {
        "id": "79",
        "Name": "Ramada Encore by Wyndham Bali Seminyak",
        "Kota": "Bali",
        "Ratings": "4.3",
        "Price": "321,555.00",
        "Addres": "Jl. Dewi Saraswati III, Seminyak, Kec. Kuta, Kota Denpasar, Bali 80361",
        "Coordinate": "-8.685535269703935, 115.17614202158985",
        "Description": "This polished hotel is 2 km from 3D art at DMZ Bali, 3 km from Seminyak Beach and 10 km from Ngurah Rai International Airport. Relaxed, warmly decorated rooms provide minibars, free Wi-Fi and flat-screen TVs, as well as tea and coffeemakers. Suites add living areas. Kids age 17 and under stay at no cost. Room service is available 24/7. A breakfast buffet, parking and an airport shuttle are complimentary. There's an airy, informal restaurant, a cafe and a bar. Other amenities include an outdoor pool and a BBQ area, plus a fitness room, a spa and a business center.",
        "Lat": "-8.68553527",
        "Long": "115.176142",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/110786796.jpg?k=e94f123de67392b7a537530f07d14393d7acb037630a4b222afe03e3a7468b9c&o=&hp=1"
    },
    "80": {
        "id": "80",
        "Name": "Jambuluwuk Oceano Seminyak Hotel",
        "Kota": "Bali",
        "Ratings": "4.3",
        "Price": "642,249.00",
        "Addres": "Jl. Petitenget No.108, Kerobokan Kelod, Kec. Kuta Utara, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.67654191715343, 115.15566028972788",
        "Description": "Along a bustling street with bars, restaurants and shops, this upscale hotel is 2 km from Seminyak Beach. Serene rooms and suites with modern Balinese decor offer free Wi-Fi and flat-screens; some have balconies. Suites add separate living areas, and some have free-standing soaking tubs. Room service is available. Amenities include 2 outdoor pools, poolside bars and a kids’ pool with a waterslide. The rooftop features an airy restaurant and billiards, and there’s a relaxed bar and restaurant adjacent to the hotel. Other amenities include a spa, a gym, a hair salon and a kids’ play area. A business center and meeting rooms are available.",
        "Lat": "-8.676541917",
        "Long": "115.1556603",
        "Images": "https://pix10.agoda.net/hotelImages/1517495/-1/d63b54318380ff8a2cd2d5ace380b064.jpg?ca=0&ce=1&s=1024x768"
    },
    "81": {
        "id": "81",
        "Name": "Le Grande Bali",
        "Kota": "Bali",
        "Ratings": "4.2",
        "Price": "596,776.00",
        "Addres": "Blok 5, Pecatu Indah Resort Jalan Raya Uluwatu, Pecatu, Kec. Kuta Sel., Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.80673925578913, 115.13053573164076",
        "Description": "Part of the Pecatu Indah Resort, this upscale hotel is an 8-minute walk from the New Kuta Golf Club, 2 km from Dreamland Beach and 11 km from the cliff-top Uluwatu Temple. Airy rooms feature free Wi-Fi, flat-screen TVs and minifridges, as well as tea and coffeemakers. All have balconies with sofas. Suites add separate living rooms; 2-bedroom suites include 2 bathrooms. Room service is offered 24/7. Breakfast, parking and a local shuttle are free. Other amenities include a relaxed restaurant with a terrace, and 3 outdoor pools. There's also a poolside cocktail bar and a plush open-air spa. Activities such as tennis, golf and cycling are offered.",
        "Lat": "-8.806739256",
        "Long": "115.1305357",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/10/7e/69/86/le-grande-bali.jpg?w=900&h=-1&s=1"
    },
    "82": {
        "id": "82",
        "Name": "AYANA Resort and Spa, BALI",
        "Kota": "Bali",
        "Ratings": "4.7",
        "Price": "4,048,848.00",
        "Addres": "647Q+GP, Jimbaran, South Kuta, Badung Regency, Bali",
        "Coordinate": "-8.786213290443014, 115.13926384240553",
        "Description": "Perched on a clifftop on the Bukit peninsula, this luxe resort is 6 km from Garuda Wisnu Kencana park and 15 km from Pura Luhur Uluwatu temple. Offering garden or ocean views, the elegant rooms come with carved wooden partitions, free Wi-Fi and flat-screen TVs, plus minibars, balconies, and tea and coffeemaking facilities. Upgraded rooms feature access to a lounge with complimentary food and drinks. Suites add sitting rooms, 4-poster beds and 2-person free-standing tubs. Villas offer plunge pools. Amenities include 9 restaurants, 4 bars and 3 cafes, plus 4 outdoor pools, beach access and tennis courts. There's also a spa and a kids' club.",
        "Lat": "-8.78621329",
        "Long": "115.1392638",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0c/ab/0c/15/ayana-upper-pool.jpg?w=1000&h=600&s=1"
    },
    "83": {
        "id": "83",
        "Name": "Wyndham Dreamland Resort Bali",
        "Kota": "Bali",
        "Ratings": "4.4",
        "Price": "Nan",
        "Addres": "Kawasan, Jl. Pecatu Indah Raya Jl. Pantai Dreamland, Pecatu, Kec. Kuta Sel., Kabupaten Badung, Bali 80364",
        "Coordinate": "-8.802186621943733, 115.12036135686262",
        "Description": "Surrounded by trees and overlooking the Indian Ocean, this chic hotel is 9 minutes by foot from Dreamland Beach. It's 18 km from Ngurah Rai International Airport. Polished rooms offer free Wi-Fi, flat-screens and minifridges. All include en suite bathrooms, private balconies and seating areas. Some feature separate bedrooms, ocean views and/or whirlpool tubs. Posh villas add private pools. Room service is available 24/7. Breakfast is available in a restaurant serving international cuisine. There's also a bar, plus an outdoor pool with a cafe. Other amenities include a spa, a gym and a yoga studio, plus a garden, event space and parking.",
        "Lat": "-8.802186622",
        "Long": "115.1203614",
        "Images": "https://pix10.agoda.net/hotelImages/3545234/-1/46ab3e128e20e040dc7c3c743b9b1f1d.jpg?ca=10&ce=1&s=1024x768"
    },
    "84": {
        "id": "84",
        "Name": "Sheraton Bali Kuta Resort",
        "Kota": "Bali",
        "Ratings": "4.6",
        "Price": "2,320,858.00",
        "Addres": "Jl. Pantai Kuta, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.718277596959451, 115.16957373836593",
        "Description": "Next to Beachwalk shopping mall, this high-end hotel is a minute's walk from Kuta Beach on the Bali Sea and 2 km from lively Jalan Legian. Posh rooms feature free Wi-Fi, iPod docks and flat-screens, plus minibar, coffeemakers, and terraces or balconies. Upgraded rooms add courtyard or sea views, while suites include living/dining areas; an upgraded suite has a rooftop pool. There's 24/7 room service. Kids age 11 and under stay at no charge with an adult. Parking is complimentary. Amenities consist of 2 restaurants, including an upscale Italian option, and a bar, plus a spa, a gym, and an infinity pool with sea views. There's also a kids' club.",
        "Lat": "-8.718277597",
        "Long": "115.1695737",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/15/9c/2e/8c/sheraton-bali-kuta-resort.jpg?w=900&h=-1&s=1"
    },
    "85": {
        "id": "85",
        "Name": "Merusaka Nusa Dua (formerly INAYA Putri Bali)",
        "Kota": "Bali",
        "Ratings": "4.6",
        "Price": "1,361,340.00",
        "Addres": "Kawasan Wisata Nusa Dua Lot S-3, Benoa, Kec. Kuta Sel., Kabupaten Badung, Bali 80363",
        "Coordinate": "-8.806877156271623, 115.22941539413046",
        "Description": "This polished beachfront resort is 1.5 km from the Bali National Golf Club and 12 km from Garuda Wisnu Kencana Cultural Park, known for its Hindu sculptures. Refined rooms with dark wood furnishings have free Wi-Fi and flat-screen TVs, as well as balconies, seating areas, minibars and rainfall showerheads. Suites – some with ocean views – offer living areas, plus in-room dining and butler services. Villas add sundecks, plunge pools and private beach cabanas. Breakfast and parking are available. The resort has 3 restaurants (1 open-air), a cocktail lounge and a beach bar, in addition to multiple lagoon-style pools.",
        "Lat": "-8.806877156",
        "Long": "115.2294154",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max500/217056726.jpg?k=b24dfa0342e41a2ac408f0c3a3abf24fdb8a6987b8eee179aa5170c6d20127b6&o=&hp=1"
    },
    "86": {
        "id": "86",
        "Name": "OYO 499 Princess Keisha Hotel & Convention Center",
        "Kota": "Bali",
        "Ratings": "3.9",
        "Price": "Nan",
        "Addres": "Jl. Teuku Umar Barat No.350, Padangsambian, Kec. Denpasar Bar., Kota Denpasar, Bali 80119",
        "Coordinate": "-8.679578854190138, 115.18801874752351",
        "Description": "Set 12 km from Ngurah Rai International Airport, this relaxed hotel is 6 km from both the popular Double Six Beach, and vibrant shopping and nightlife on Jalan Legian. Unpretentious room with warm furnishings offer free Wi-Fi, flat-screen TVs and minibars, plus minifridges and coffeemakers; some add sofabeds. Refined suites with modern decor sleep up to 3 guests and feature chic lounge areas. Breakfast is complimentary. There's a garden, and an outdoor pool with a kids' section. Other amenities include meeting rooms and event space.",
        "Lat": "-8.679578854",
        "Long": "115.1880187",
        "Images": "https://ik.imagekit.io/tvlk/apr-asset/dgXfoyh24ryQLRcGq00cIdKHRmotrWLNlvG-TxlcLxGkiDwaUSggleJNPRgIHCX6/hotel/asset/10000706-f9e0f3d85ff99c5b31a2262f4d63e479.jpeg?_src=imagekit&tr=c-at_max,h-488,q-40,w-768"
    },
    "87": {
        "id": "87",
        "Name": "Rofa Kuta Hotel",
        "Kota": "Bali",
        "Ratings": "4.1",
        "Price": "177,413.00",
        "Addres": "Jl. Nakula No.9, Legian, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.699314570260176, 115.17956550674633",
        "Description": "Within walking distance of eateries, this informal hotel in an ornate, modern building is 4 minutes' walk from the DMZ Trick Art Museum, 2 km from Double Six Beach and 7 km from I Gusti Ngurah Rai International Airport. Simply furnished rooms with bright wall art provide complimentary Wi-Fi, flat-screen TVs, minibars and safes, plus tea and coffeemaking facilities. Upgraded rooms and suites add furnished balconies; some have sofas and/or quirky vintage-inspired seating. There's a warm restaurant, an outdoor pool and a spa.",
        "Lat": "-8.69931457",
        "Long": "115.1795655",
        "Images": "https://new-hls.s3.amazonaws.com/hls/data/3848/website/general/bn/mobile_pool-resize.jpg"
    },
    "88": {
        "id": "88",
        "Name": "Golden Tulip Jineng Resort Bali",
        "Kota": "Bali",
        "Ratings": "4.4",
        "Price": "283,936.00",
        "Addres": "Jl. Sunset Road No.98, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.718416082969146, 115.1836207067463",
        "Description": "In the village center, this upscale hotel is 3 km from Kuta Beach and 13 km from the Garuda Wisnu Kencana Cultural Park. Warmly decorated rooms feature free Wi-Fi and flat-screens, plus minibars, safes, and tea and coffeemakers. Some offer balconies overlooking a lagoon pool. Suites provide living rooms; some include kitchenettes, whirlpool tubs and/or direct pool access. Room service is available 24/7. A breakfast buffet is free. A glass-enclosed eatery serves international cuisine, and there's a casual restaurant/bar next to a lagoon-style pool. Other amenities include a kids' pool and a game room, plus a gym, a spa and a yoga studio.",
        "Lat": "-8.718416083",
        "Long": "115.1836207",
        "Images": "https://origin.pegipegi.com/jalan/images/pict1L/Y6/Y940766/Y940766003.jpg"
    },
    "89": {
        "id": "89",
        "Name": "Daun Bali Seminyak Hotel",
        "Kota": "Bali",
        "Ratings": "4.4",
        "Price": "322,993.00",
        "Addres": "Jl. Petitenget No.8, Kerobokan Kelod, Kec. Kuta Utara, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.67206881544723, 115.1635807355821",
        "Description": "This polished hotel on a bustling commercial street is 4 km from both Seminyak Beach and DMZ Bali, a 3D art museum, and 12 km from Bali Ngurah Rai International Airport. Featuring chic, neutral decor, the stylish rooms come with free Wi-Fi and smart TVs, as well as minifridges, safes, and tea and coffeemaking facilities. Upgraded rooms have sitting areas, balconies and/or kitchenettes. Room service is available. Amenities include a striking restaurant/bar with contemporary decor, plus an outdoor pool that has an adjacent bar. There's also a spa, and a rooftop terrace featuring a hot tub and a relaxed bar.",
        "Lat": "-8.672068815",
        "Long": "115.1635807",
        "Images": "https://ik.imagekit.io/tvlk/apr-asset/dgXfoyh24ryQLRcGq00cIdKHRmotrWLNlvG-TxlcLxGkiDwaUSggleJNPRgIHCX6/hotel/asset/10012189-0ed7621ba9695dc83e9acf812b4eeb8f.jpeg?_src=imagekit&tr=c-at_max,h-488,q-40,w-768"
    },
    "90": {
        "id": "90",
        "Name": "Aryaduta Bali",
        "Kota": "Bali",
        "Ratings": "4.6",
        "Price": "631,795.00",
        "Addres": "Jl. Kartika Plaza, Lingkungan Segara, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.735791178046982, 115.16696344118643",
        "Description": "Set next to Lippo Mall Kuta, this polished hotel is a 9-minute walk from Jerman Beach on the Bali Sea and 3 km from Ngurah Rai International Airport. The airy, refined rooms provide Wi-Fi access, flat-screen TVs and safes, plus sitting areas with sofas. Some upgraded rooms are interconnected and/or add balconies. Room service is available. Children age 15 and under stay at no extra cost with an adult. Breakfast is complimentary. There's a hip restaurant and sports bar featuring pinball machines and a pool table. Other amenities include a rooftop pool, a gym and a movie theater. Parking and event space are offered.",
        "Lat": "-8.735791178",
        "Long": "115.1669634",
        "Images": "https://pwmu.co/wp-content/uploads/2019/11/hotel-bali_EDIT_1.jpg"
    },
    "91": {
        "id": "91",
        "Name": "OYO 1670 Likko Inn",
        "Kota": "Bali",
        "Ratings": "4.0",
        "Price": "110,306.00",
        "Addres": "Jl. Suli No.11, Dangin Puri Kangin, Kec. Denpasar Utara, Kota Denpasar, Bali 80234",
        "Coordinate": "-8.64802340342829, 115.22289370674633",
        "Description": "A 17-minute walk from the Bali Museum, this down-to-earth budget hotel is 5 km from the Bajra Sandhi Monument and 16 km from Ngurah Rai International Airport. Featuring tile floors, the no-nonsense rooms offer flat-screen TVs, air conditioning and en suite bathrooms, as well as Wi-Fi. There's an outdoor pool and a convenience shop. Parking is available.",
        "Lat": "-8.648023403",
        "Long": "115.2228937",
        "Images": "https://ik.imagekit.io/tvlk/apr-asset/dgXfoyh24ryQLRcGq00cIdKHRmotrWLNlvG-TxlcLxGkiDwaUSggleJNPRgIHCX6/hotel/asset/20003101-5698f72971e7461b4ea4a8595a2e51f0.jpeg?tr=q-40,c-at_max,w-1280,h-720&_src=imagekit"
    },
    "92": {
        "id": "92",
        "Name": "Coco De Heaven",
        "Kota": "Bali",
        "Ratings": "3.8",
        "Price": "123,505.00",
        "Addres": "Jl. Bypass Ngurah Rai No.17X, Kedonganan, Kec. Kuta Sel., Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.75856147952032, 115.17935147791054",
        "Description": "Nan",
        "Lat": "-8.75856148",
        "Long": "115.1793515",
        "Images": "https://img.hotelmurah.com/hotel/myhm_8366_1.jpg"
    },
    "93": {
        "id": "93",
        "Name": "Grand Lifestyle Hotel",
        "Kota": "Bali",
        "Ratings": "3.5",
        "Price": "Nan",
        "Addres": "Jl. Teuku Umar No.175-179, Dauh Puri Kauh, Kec. Denpasar Bar., Kota Denpasar, Bali 80114",
        "Coordinate": "-8.678528738605127, 115.20553593605858",
        "Description": "Nan",
        "Lat": "-8.678528739",
        "Long": "115.2055359",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/110348877.jpg?k=d235b72ec9f82d9308e0d93d3bf822f47ac85056a048c8015891c6b00f59a575&o=&hp=1"
    },
    "94": {
        "id": "94",
        "Name": "Hard Rock Hotel Bali",
        "Kota": "Bali",
        "Ratings": "4.6",
        "Price": "1,689,076.00",
        "Addres": "Jl. Pantai Kuta, Banjar Pande Mas, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.721666974025217, 115.17075860607434",
        "Description": "Across the street from the beach, this music-themed resort hotel with indigenous architecture is 2 km from the shops at Jalan Legian and 7 km from Waterbom Bali. Bold contemporary rooms feature balconies, flat-screen TVs, daybeds, minibars and free Wi-Fi. Upgraded quarters add Nespresso machines and direct pool access. Suites include living rooms and access to a private bar/lounge; some have home theaters and/or kitchenettes. Some quarters have sea views. Free parking and breakfast are available. There's also a pool, a spa, rock climbing and 7 restaurants/bars, plus a fitness center, a recording studio and a kids' club.",
        "Lat": "-8.721666974",
        "Long": "115.1707586",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/10/4b/3a/a1/waterslide-at-sand-island.jpg?w=900&h=-1&s=1"
    },
    "95": {
        "id": "95",
        "Name": "Harper Kuta by ASTON",
        "Kota": "Bali",
        "Ratings": "4.3",
        "Price": "348,301.00",
        "Addres": "Jl. Raya Legian No.73, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.718956497574473, 115.17474187791056",
        "Description": "This modern hotel on a bustling shopping road is a 2-minute walk from the Bali Bombing Memorial, 11 minutes on foot from Kuta Beach and 2 km from Waterborn Bali water park. Contemporary rooms with floor-to-ceiling windows feature complimentary Wi-Fi, flat-screen TVs, safes, and tea and coffeemaking facilities. Suites add additional beds, sitting areas, DVD players and free-standing tubs. Room service is available 24 hours. Parking is included, as is breakfast served in an open-air restaurant that has a bar. There's also a spa, an outdoor pool and a kids' pool.",
        "Lat": "-8.718956498",
        "Long": "115.1747419",
        "Images": "https://media-cdn.tripadvisor.com/media/photo-s/16/81/df/65/exterior.jpg"
    },
    "96": {
        "id": "96",
        "Name": "Hawaii Bali Villa",
        "Kota": "Bali",
        "Ratings": "4.4",
        "Price": "Nan",
        "Addres": "Jl. Tukad Balian No.899X, Sanur, Denpasar Selatan, Kota Denpasar, Bali 80361",
        "Coordinate": "-8.705635555564543, 115.2396031914032",
        "Description": "Nan",
        "Lat": "-8.705635556",
        "Long": "115.2396032",
        "Images": "https://pix10.agoda.net/hotelImages/686610/-1/e87afe36fc4fda80a2856a9468429e10.jpg?ca=7&ce=1&s=1024x768"
    },
    "97": {
        "id": "97",
        "Name": "Kutabex Beachfront Hotel",
        "Kota": "Bali",
        "Ratings": "4.2",
        "Price": "270,001.00",
        "Addres": "Jalan Pantai Kuta, Banjar Pande Mas, Kuta, Badung Regency, Bali 80361",
        "Coordinate": "-8.72017813579893, 115.1697230261405",
        "Description": "On a buzzy promenade lined with restaurants, this modern hotel is across the street from Kuta Beach on the Indian Ocean and 4 km from 3D art at DMZ Bali. Relaxed rooms provide Wi-Fi, flat-screen TVs and safes, along with minibars, and tea and coffeemaking facilities. Upgraded rooms add sitting areas. A vibrant restaurant and sports bar offers billiards tables and nightly live entertainment. There's also a rooftop bar that offers ocean views and adjoins an outdoor infinity pool. Massages and beauty treatments are available. Breakfast is extra.",
        "Lat": "-8.720178136",
        "Long": "115.169723",
        "Images": "https://origin.pegipegi.com/jalan/images/pict1L/Y6/Y979536/X979536001.jpg"
    },
    "98": {
        "id": "98",
        "Name": "Paditeras Boutique Hotel Seminyak",
        "Kota": "Bali",
        "Ratings": "4.3",
        "Price": "Nan",
        "Addres": "Jl. Lb. Sari No.19, Seminyak, Kec. Kuta Utara, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.676428714184437, 115.15888312201461",
        "Description": "Nan",
        "Lat": "-8.676428714",
        "Long": "115.1588831",
        "Images": "https://images.trvl-media.com/hotels/10000000/9800000/9795900/9795829/dbb9b66f.jpg?impolicy=resizecrop&rw=670&ra=fit"
    },
    "99": {
        "id": "99",
        "Name": "Fashion Hotel Legian",
        "Kota": "Bali",
        "Ratings": "4.2",
        "Price": "209,203.00",
        "Addres": "Jl. Raya Legian No.121, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.713529277004127, 115.17353064671619",
        "Description": "This modern hotel with a high-fashion theme is 8 minutes on foot from lively Jalan Legian and 1 km from Kuta Beach. It's 7 km from Ngurah Rai International Airport. The sophisticated rooms provide safes, flat-screen TVs and free Wi-Fi, in addition to tea and coffeemaking equipment. Some have balconies. Breakfast and parking are complimentary. Other amenities consist of an outdoor pool, an Italian restaurant, a nightclub, and rooftop hot tubs.",
        "Lat": "-8.713529277",
        "Long": "115.1735306",
        "Images": "https://ak-d.tripcdn.com/images/0224p120009cob3saE2EF_Z_550_412_R5_Q70_D.jpg"
    },
    "100": {
        "id": "100",
        "Name": "HARRIS Hotel Kuta Galleria",
        "Kota": "Bali",
        "Ratings": "4.3",
        "Price": "316,354.00",
        "Addres": "Jl. Bypass Ngurah Rai No.1, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.721868883263062, 115.18629139325365",
        "Description": "Set on a main thoroughfare 3 minutes' walk from Bali Galeria mall, this colorful, modern hotel with a hip vibe is across the street from a lake and 3 km from lively Kuta Beach. Unfussy rooms with bright contemporary decor provide free Wi-Fi, daybeds and flat-screens along with tea and coffeemakers, minibars and aromatherapy kits. Some offer lake views. Suites add separate living rooms with pull-out sofas. Room service is available 24/7 Amenities include a simple cafe with a terrace and tropical plants, as well as a gym, an outdoor pool and a lobby lounge. There's also a meeting room and a kids' club.",
        "Lat": "-8.721868883",
        "Long": "115.1862914",
        "Images": "https://pix10.agoda.net/hotelImages/699559/-1/05b97d465a210535b50e514125c919e5.jpg?ca=0&ce=1&s=1024x768"
    },
    "101": {
        "id": "101",
        "Name": "Sthala, a Tribute Portfolio Hotel, Ubud Bali",
        "Kota": "Bali",
        "Ratings": "4.7",
        "Price": "1,190,198.00",
        "Addres": "Jalan A.A Gede Rai, Jl. Raya Mawang Kelod, Lodtunduh, Ubud, Bali 80571",
        "Coordinate": "-8.572468688216045, 115.25964208476907",
        "Description": "Set on a lush riverside property, this upscale hotel with traditional styling is 6 km from both Tegenungan Waterfall and the Agung Rai Museum of Art, and 7 km from the Ubud Monkey Forest. Featuring balconies, the polished rooms come with free high-speed Wi-Fi and flat-screen TVs, plus minibars and kitchenettes; some offer river views. Room service is available 24/7. Parking and a local shuttle are free. There's also an open-air restaurant, a rooftop bar and a poolside bar. Other amenities include 2 outdoor pools, a gym and yoga. Balinese dancing and cooking classes are offered.",
        "Lat": "-8.572468688",
        "Long": "115.2596421",
        "Images": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/176490590.jpg?k=e2dd72ee448e1d51fa52cb817bc5e94619200621a58b549b9761b2f0efdcfadc&o=&hp=1"
    },
    "102": {
        "id": "102",
        "Name": "Mulia Resort",
        "Kota": "Bali",
        "Ratings": "4.7",
        "Price": "3,668,680.00",
        "Addres": "Kawasan Sawangan, Jl. Raya Nusa Dua Selatan Jl. Nusa Dua, Benoa, Kec. Kuta Sel., Kabupaten Badung, Bali 80363",
        "Coordinate": "-8.815972290633553, 115.22320225092524",
        "Description": "This premium tropical resort, set on the white-sand Nusa Dua Beach along the Bali Sea, is 4 km from Museum Pasifika's art galleries and 9 km from the Bukit Peninsula, a popular surfing spot. Plush rooms with marble floors provide free Wi-Fi, flat-screen TVs and luxe bedding, as well patios or balconies with sea or garden views. Suites add living areas; some have vaulted ceilings. Room service is available. Amenities consist of a hot tub, a gym and a spa, along with 4 outdoor pools, 3 bars and 6 restaurants, including Japanese and Chinese options. Activities such as kayaking, yoga and tennis can be arranged.",
        "Lat": "-8.815972291",
        "Long": "115.2232023",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/19/a5/f2/d6/mulia-resort.jpg?w=900&h=-1&s=1"
    },
    "103": {
        "id": "103",
        "Name": "J Hotel Kuta",
        "Kota": "Bali",
        "Ratings": "4.2",
        "Price": "170,668.00",
        "Addres": "Jalan Raya Kuta No.88D, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.72919085668914, 115.17697470674632",
        "Description": "",
        "Lat": "-8.729190857",
        "Long": "115.1769747",
        "Images": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/10/6a/8a/2f/j-hotel-tampak-depan.jpg?w=900&h=-1&s=1"
    },
    "104": {
        "id": "104",
        "Name": "Ivanka Airport Inn",
        "Kota": "Bali",
        "Ratings": "3.6",
        "Price": "172,262.00",
        "Addres": "Jl. Puri Gerenceng No.2, Tuban, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.740948597886979, 115.17254886441789",
        "Description": "Nan",
        "Lat": "-8.740948598",
        "Long": "115.1725489",
        "Images": "https://s-light.tiket.photos/t/01E25EBZS3W0FY9GTG6C42E1SE/t_htl-dskt/tix-hotel/images-web/2020/10/29/f9b394ae-1ca3-4704-a005-0564086ca139-1603904770412-ed22f83ca2a0b28f8e71b044859f894a.jpg"
    },
    "105": {
        "id": "105",
        "Name": "Singaraja Hotel",
        "Kota": "Bali",
        "Ratings": "4.1",
        "Price": "197,750.00",
        "Addres": "Kp. Baru, Kec. Buleleng, Kabupaten Buleleng, Bali 81113",
        "Coordinate": "-8.102818880869965, 115.09071697121786",
        "Description": "This casual modern hotel on the Bali Sea is 10 km from both lively Lovina Beach and the Aling-Aling waterfall. The streamlined, colorful rooms feature flat-screen TVs and free Wi-Fi, as well as in-room safe deposit boxes. Free breakfast is served in a low-key dining area. The hotel also offers a beachfront pool, as well as a patio with lounge chairs. There's also a meeting room.",
        "Lat": "-8.102818881",
        "Long": "115.090717",
        "Images": "https://www.balipost.com/wp-content/uploads/2019/10/balipostcom_singaraja-hotel-akomodasi-wisata-berkelas-di-kota-singaraja_01-696x464.jpg"
    },
    "106": {
        "id": "106",
        "Name": "Grand Ixora Kuta Resort",
        "Kota": "Bali",
        "Ratings": "4.2",
        "Price": "212,820.00",
        "Addres": "Jl. Kartika Plaza No.92, Kuta, Kec. Kuta, Kabupaten Badung, Bali 80361",
        "Coordinate": "-8.73388498268596, 115.16752952937662",
        "Description": "Set in an angular, modern building, this upscale hotel is 3 km from Ngurah Rai International Airport and 6 km from the upmarket Seminyak district. The vibrant rooms with balconies feature sleek furnishings and provide flat-screen TVs, free Wi-Fi and minifridges, plus tea and coffeemaking facilities. Upgraded rooms add DVD players and seating areas. Parking is free. Other amenities include an airy restaurant, an outdoor pool and bar, and a spa. Babysitting services are available and there's a lounge with guest computers. Activities such as weaving or fruit carving are offered for a fee.",
        "Lat": "-8.733884983",
        "Long": "115.1675295",
        "Images": "https://imgcy.trivago.com/c_limit,d_dummy.jpeg,f_auto,h_1300,q_auto,w_2000/itemimages/20/48/2048909_v2.jpeg"
    },
    "107": {
        "id": "107",
        "Name": "Bali Nusa Dua Hotel",
        "Kota": "Bali",
        "Ratings": "4.6",
        "Price": "692,608.00",
        "Addres": "Kawasan Pariwisata Nusa Dua Lot NW/1, Benoa, Kec. Kuta Sel., Kabupaten Badung, Bali 80363",
        "Coordinate": "-8.793587395914745, 115.2266589067463",
        "Description": "An 8-minute walk from Pantai Samuh beach, this polished hotel is 2 km from Bali National Golf Club and 12 km from Ngurah Rai International Airport. The streamlined rooms offer free Wi-Fi and flat-screen TVs, plus minibars, and tea and coffeemaking facilities. Suites add separate living areas. Room service is available. An area shuttle is complimentary. Other amenities include a buffet restaurant, an outdoor pool and a fitness room, as well as a spa and a kids’ play area.",
        "Lat": "-8.793587396",
        "Long": "115.2266589",
        "Images": "https://balinusaduahotel.com/wp-content/uploads/2019/10/balinusaduahotel-lagoon.jpg"
    },
    "108": {
        "id": "108",
        "Name": "Golden Tulip Essential Denpasar",
        "Kota": "Bali",
        "Ratings": "4.2",
        "Price": "181,425.00",
        "Addres": "Jl. Gatot Subroto Barat No.101, Padangsambian Kaja, Kec. Denpasar Bar., Kota Denpasar, Bali 80118",
        "Coordinate": "-8.635958981591507, 115.19312212031377",
        "Description": "Set in the Central Business District, this informal hotel is 2 km from Terminal Bus Ubung and 4 km from Badung Market. Unpretentious rooms have bathrooms with rainfall showerheads, and come with free Wi-Fi, flat-screen TVs, and tea and coffeemaking facilities. There's a casual restaurant with a terrace, as well as a bar. Other amenities include an outdoor pool and a spa.",
        "Lat": "-8.635958982",
        "Long": "115.1931221",
        "Images": "https://www.kayak.co.id/rimg/himg/b0/8a/bb/ice-25869-7895914_3XL-473399.jpg?width=1366&height=768&crop=true"
    },
    "109": {
        "id": "109",
        "Name": "Negara Hotel",
        "Kota": "Bali",
        "Ratings": "3.8",
        "Price": "201,729.00",
        "Addres": "Jl. Ngurah Rai No.107, Pendem, Kec. Negara, Kabupaten Jembrana, Bali 82218",
        "Coordinate": "-8.360591192592048, 114.62912890674632",
        "Description": "On a bustling commercial street, this simple budget hotel is a 7-minute walk from Negara Bus Terminal and 10 km from Baluk Rening Beach. Basic rooms with modest decor offer Wi-Fi access and flat-screen TVs. Upgraded quarters add bathrooms with hot water, plus tea and coffeemaking equipment; some include safes, minifridges and whirlpool tubs. Parking is complimentary. There's a low-key restaurant, massage services and bike rentals, plus a meeting room.",
        "Lat": "-8.360591193",
        "Long": "114.6291289",
        "Images": "https://www.indoplaces.com/foto/hotel/jimbarwana-hotel.jpg"
    },
    "110": {
        "id": "110",
        "Name": "The Westin Resort Nusa Dua, Bali",
        "Kota": "Bali",
        "Ratings": "4.6",
        "Price": "1,996,448.00",
        "Addres": "Itdc, Kawasan Pariwisata, Jl. Nusa Dua No.3, Bali 80363",
        "Coordinate": "-8.795690793342184, 115.2307301355821",
        "Description": "This luxe, beachfront hotel is 2.9 km from Bali National Golf Club and 14 km from Waterbomb Bali waterpark. Featuring earthy tones and balconies with ocean, pool or garden views, the lavish rooms and suites offer free Wi-Fi, flat-screen TVs and iPod docks. They also have minifridges, coffeemakers and plush sitting areas; some add furnished terraces. Suites have separate sitting and dining areas, some come with private pools. There's 24-hour room service. Amenities include 5 restaurants, a chic bar and an elegant lobby lounge. There’s also a gym, a spa and a kids’ club. Outside are 3 pools, thatched day beds and tennis courts.",
        "Lat": "-8.795690793",
        "Long": "115.2307301",
        "Images": "https://imgcy.trivago.com/c_limit,d_dummy.jpeg,f_auto,h_1300,q_auto,w_2000/itemimages/93/91/93914_v5.jpeg"
    }
}